[
  {
    "Topic": -1,
    "Count": 49948,
    "Name": "-1_the_to_and_of",
    "Representation": [
      "the",
      "to",
      "and",
      "of",
      "in",
      "is",
      "for",
      "climate",
      "that",
      "on"
    ],
    "Representative_Docs": [
      "We lost our BRIC grants and a lot of other climate changed funding is up in the air. Nothing I can do about that, but at least I can make sure our little piece of the Chesapeake Bay has the data we need to make informed decisions about our town's future.",
      "The time has come to turn away from fossil fuels - and to move to clean energy, but without leaving anyone behind. The UK government is consulting on the future of the North Sea. It's important they hear from us all If you agree, add your name to the petition secure.avaaz.orgcampaignen...",
      "There's only one solution to our climate crisis in terms of how to get climate actions from enough people in order to begin reducing the amount of greenhouse gases in our thin, precious atmosphere and that is to create the political will for doing that in the majority of the electorate."
    ]
  },
  {
    "Topic": 0,
    "Count": 2128,
    "Name": "0_solar_energy_power_electricity",
    "Representation": [
      "solar",
      "energy",
      "power",
      "electricity",
      "wind",
      "the",
      "to",
      "of",
      "in",
      "nuclear"
    ],
    "Representative_Docs": [
      "Unthinkable just 10 years ago Almost 34 of the EU’s electricity in 2024 was from renewable energy sources and nuclear. Gas and coal electricity generation is at record low levels.",
      "Storage and output is a real challenge. Most experts say we need to use all sources of energy to meet our needs. Some oil and gas with minimum of use,small nuclear with solar and wind. It's combining all that will be the solution. Reality is certain locations can't rely on solar and wind.",
      "Since when is one or the other? Batteries and solar panels for everyone but use coal and combined cycle to help achieve the needs of electricity... Nuclear, wind and solar are all allies, not competing technologies."
    ]
  },
  {
    "Topic": 1,
    "Count": 1760,
    "Name": "1_climate_the_trump_to",
    "Representation": [
      "climate",
      "the",
      "trump",
      "to",
      "change",
      "is",
      "weather",
      "and",
      "of",
      "that"
    ],
    "Representative_Docs": [
      "The Trump Regime will stop funding research on the health effects of climate change, because, of course they will. They will stop funding everything that is worth funding",
      "Get readily for the Trump administration to do this same thing to ALL OTHER STATES THAT WILL HAVE NATURAL CLIMATE CHANGE DISASTERS.",
      "From the report There’s really no coming back from this, and it means we are all less informed about climate impacts, and won’t have the most up-to-date information on risks and threats, TRUMP IS LITERALLY BLOCKING THE SCIENCE"
    ]
  },
  {
    "Topic": 2,
    "Count": 1355,
    "Name": "2_flooding_in_india_climate",
    "Representation": [
      "flooding",
      "in",
      "india",
      "climate",
      "the",
      "climatecrisis",
      "of",
      "heat",
      "flood",
      "weather"
    ],
    "Representative_Docs": [
      "Your 'moment of doom' for Apr. 16, 2025 Wet bulb alert! \"Extreme heat has killed tens of thousands of people in India and Pakistan in recent decades and climate experts have warned that by 2050 India will be among the first places where temperatures will cross survivability limits.\"",
      "Italy flood Turin destruction anomaly climatecrisis weather climatechange On April 16, 2025, the municipality of Agliè, located in the province of Turin, experienced a severe flood. The flooding was caused by prolonged heavy rainfall, leading to a sudden rise in water levels.",
      "India is one of the fastest growing major economies in the world. Also top 5 in pollution in the world. It has water scarcity. Climate change is making heatwaves in India and Pakistan 30 times more likely."
    ]
  },
  {
    "Topic": 3,
    "Count": 1027,
    "Name": "3_environmental_climate_students_and",
    "Representation": [
      "environmental",
      "climate",
      "students",
      "and",
      "for",
      "justice",
      "in",
      "to",
      "on",
      "education"
    ],
    "Representative_Docs": [
      "Extreme weather, poor air quality, and environmental hazards are disrupting student health learning. How can we keep schools open students safe? Healthy Schools Network is hosting a webinar series this week to address these challenges with experts in the field. Learn more tinyurl.comywn8jzhy",
      "Happy Student Employee Appreciation Week! Thank you Raegan for supporting the team in so many ways and all the best as you finish up your senior year studying environmental earth science sustainability! In the fall she plans to attend law school to focus on environmental law.",
      "To everyone who protested on Saturday and beyond for the climate, social justice, and democracy, WE STAND WITH YOU. Send us a message if you want to hear more about our work, and how we can support you. Our DMs are open! handsoff greensky climate"
    ]
  },
  {
    "Topic": 4,
    "Count": 887,
    "Name": "4_water_epa_pfas_pollution",
    "Representation": [
      "water",
      "epa",
      "pfas",
      "pollution",
      "environmental",
      "air",
      "chemicals",
      "toxic",
      "toxins",
      "the"
    ],
    "Representative_Docs": [
      "One thing tertiary treatment can't remove is PFAS. Removing forever chemicals from drinking water is hugely difficult costly, strips water of beneficial minerals, which is why water suppliers in Switzerland are calling for a ban on PFAS, arguing some pollution needs to be addressed at source.",
      "One thing tertiary treatment can't remove is PFAS. Removing forever chemicals from drinking water is hugely difficult costly, strips water of beneficial minerals, which is why water suppliers in Switzerland are calling for a ban on PFAS, arguing some pollution needs to be addressed at source.",
      "\"Trump's EPA\"... more like Trump's Environmental Pollution Agency."
    ]
  },
  {
    "Topic": 5,
    "Count": 882,
    "Name": "5_eu_the_european_norway",
    "Representation": [
      "eu",
      "the",
      "european",
      "norway",
      "to",
      "circular",
      "in",
      "europe",
      "and",
      "finland"
    ],
    "Representative_Docs": [
      "Latest data 2023 published by EEA shows energy sector led the way in reducing domestic EU net greenhouse gas emissions. Read more here EU climate energy renewables",
      "EU's carbon market works. Latest data shows EU is on track to achieve the 2030 target of -62%. Also, renewables are on the rise. More here ETS EU capandtrade",
      "Good but we in EU must create a real single market. Now logistics often requires a hundred documents just to move basic cargo within EU. It is insane, way worse than any tariffs. The EU emissions trade and reporting for example doesn't work at all. Best way to reduce emissions is to tax them."
    ]
  },
  {
    "Topic": 6,
    "Count": 865,
    "Name": "6_trump_energy_fossil_gas",
    "Representation": [
      "trump",
      "energy",
      "fossil",
      "gas",
      "to",
      "the",
      "trumps",
      "donald",
      "renewable",
      "eu"
    ],
    "Representative_Docs": [
      "Donald Trump is blackmailing the EU to buy even more fossil gas. Our leaders are now forced to choose a future of gas dependency or renewable freedom. Tell them to break free from fossil fuels! action.wemove.eusign2025-04...",
      "Donald Trump is blackmailing the EU to buy even more fossil gas. Our leaders are now forced to choose a future of gas dependency or renewable freedom. Tell them to break free from fossil fuels! action.wemove.eusign2025-04...",
      "Donald Trump is blackmailing the EU to buy even more fossil gas. Our leaders are now forced to choose a future of gas dependency or renewable freedom. Tell them to break free from fossil fuels! action.wemove.eusign2025-04..."
    ]
  },
  {
    "Topic": 7,
    "Count": 725,
    "Name": "7_planet_we_the_to",
    "Representation": [
      "planet",
      "we",
      "the",
      "to",
      "environment",
      "our",
      "and",
      "that",
      "of",
      "it"
    ],
    "Representative_Docs": [
      "And all I’m saying is that we have a lot of fucking people on this planet already.",
      "The entire world needs to stop living as if it's business as usual or we will not be able to survive the escalating climate crisis. We all need to join together to work together to repair the damage we've done to our planet! There is NO other viable planet for us! We must terraform Earth to health",
      "The planet will be fine, its inhabitants are not and will not be okay if we keep polluting the water, soil and air. Give it 25000 years after we have died off and the planet will look like we were never here."
    ]
  },
  {
    "Topic": 8,
    "Count": 714,
    "Name": "8_scotland_labour_uk_the",
    "Representation": [
      "scotland",
      "labour",
      "uk",
      "the",
      "ireland",
      "of",
      "to",
      "for",
      "in",
      "is"
    ],
    "Representative_Docs": [
      "I'm not assuming anything. I'm pointing out that Labour and SNP have similar policies in transitioning away from fossil fuel and Labour is funding by 200m the transition in Scotland in relation to Grangemouth.",
      "There are 49 gas fired Power stations in the UK, of which 1 is located in Scotland at Peterhead. The unit rate for electricity generated is based on the current gas price. So, why does Scotland have the highest rate for electricity in the UK. Scotland also exports 38% of the electricity it produces",
      "Scotland is a significant producer of UK wind power. Only recently, all of England overtook Scotland, as the primary UK supplier of wind-generated electricity. Scotland's wind power STILL accounts for around 48% of the total. Nearly Half. There are just 5.5 million Scots. Wake up Scotland."
    ]
  },
  {
    "Topic": 9,
    "Count": 547,
    "Name": "9_energy_bill_assistance_credits",
    "Representation": [
      "energy",
      "bill",
      "assistance",
      "credits",
      "program",
      "liheap",
      "tax",
      "status",
      "committee",
      "home"
    ],
    "Representative_Docs": [
      "One day remaining to apply for energy funding through LIHEAP httpswww.byteseu.com933030 CONTACT POLICE. IF YOU NEED HELP PAYING YOUR HOME HEATING BILLS, YOU ONLY HAVE ONE MORE DAY TO APPLY FOR FUNDING THROUGH THE LOW INCOME HOME ENERGY ASSISTANCE PROGRAM, OR LIHEAP. THERE WERE CONCERNS",
      "This month’s decision by the Trump Admin to lay off the entire staff of the Low Income Home Energy Assistance Program is a major blow to millions of Americans who rely on it for help heating and cooling their homes. Our statement swenergy.orgdismantling-low-income-home-energy-assistance-program",
      "The U.S. Department of Health and Human Services cut all federal staff to the Low Income Home Energy Assistance Program, or LIHEAP, earlier this month. Congress gave more than 4 billion to the program last fiscal year."
    ]
  },
  {
    "Topic": 10,
    "Count": 489,
    "Name": "10_air_pollution_aerosols_london",
    "Representation": [
      "air",
      "pollution",
      "aerosols",
      "london",
      "the",
      "in",
      "dust",
      "of",
      "quality",
      "atmosphere"
    ],
    "Representative_Docs": [
      "Gas combustion in boilers mainly industrial is now a dominant source of nitrogen oxides emissions in London. While it shows that Low Emissions Zones have great benefits, it also highlights what else must be done to improve air quality. Read more in the linked article!",
      "Gas combustion in boilers mainly industrial is now a dominant source of nitrogen oxides emissions in London. While it shows that Low Emissions Zones have great benefits, it also highlights what else must be done to improve air quality. Read more in the linked article!",
      "Gas boilers now biggest source of air pollution in central London httpsapple.newsAVm5DbqtyRwWjDRhdzjXHgQ"
    ]
  },
  {
    "Topic": 11,
    "Count": 457,
    "Name": "11_green_arena_pledge_art",
    "Representation": [
      "green",
      "arena",
      "pledge",
      "art",
      "seattle",
      "zero",
      "so",
      "coyg",
      "this",
      "the"
    ],
    "Representative_Docs": [
      "Dream From The Bottom Phish Climate Pledge Arena Seattle, Washington Friday April 18 2025 Phish",
      "we come from the city of climate pledge arena I can’t top that",
      "First night of Phish Spring tour! Come find us at sec 4 and 11! Did you know that The Climate Pledge Arena is the world’s FIRST Zero Carbon Certified Arena? phish waterwheelfoundation waterwheelfromtheroad"
    ]
  },
  {
    "Topic": 12,
    "Count": 454,
    "Name": "12_indigenous_brazil_amazon_cop30",
    "Representation": [
      "indigenous",
      "brazil",
      "amazon",
      "cop30",
      "deforestation",
      "brazils",
      "meat",
      "climate",
      "in",
      "and"
    ],
    "Representative_Docs": [
      "Revealed world’s largest meat company may break Amazon deforestation pledges again Amazon Climate Goals Deforestation Li Rainforest httpswww.theguardian.comenvironment2025apr17revealed-worlds-largest-meat-company-jbs-may-break-amazon-deforestation-pledges-again",
      "'An Indigenous man attends a march called \"We are the answer\" where Brazil's Indigenous people discuss rights, territorial protection and their role in the COP30 world climate conference, which will take place for the first time in the Amazon.'",
      "International Indigenous Commission to take part in COP30 negotiations politics brazil environmentalism indigenous geopolitics COP30 agenciabrasil.ebc.com.brendireitos-..."
    ]
  },
  {
    "Topic": 13,
    "Count": 452,
    "Name": "13_green_greenwashing_energy_the",
    "Representation": [
      "green",
      "greenwashing",
      "energy",
      "the",
      "is",
      "of",
      "to",
      "and",
      "it",
      "we"
    ],
    "Representative_Docs": [
      "How I hope and think it will all go longterm 1. The green energy transition is coming because it's more economical overall gives us all energy independence from each other. 2. New Green maybe fission powered Liberal Social Market Democracy is proven as the best political-economic system of all",
      "Hey guys, look! We're in the green again! These tariffs are really starting to pay off! Cause...green is ..green means good, right? Right?",
      "People said the same thing about all green energy. That it was made from fossil fuels and therefore not green. But that changed the moment we actually tried making it from green sources. In reality, this is a pro-fossil fuel talking point. It is a tactic of climate change deniers."
    ]
  },
  {
    "Topic": 14,
    "Count": 448,
    "Name": "14_greenland_ukraine_russia_putin",
    "Representation": [
      "greenland",
      "ukraine",
      "russia",
      "putin",
      "climate",
      "trump",
      "to",
      "the",
      "nato",
      "change"
    ],
    "Representative_Docs": [
      "Maybe Trump wants climate change to melt the ice on Greenland.",
      "Trump insists neither Russia nor Ukraine are playing’ him as peace talks continue httpswww.europesays.com2007177 Your support helps us to tell the story From reproductive rights to climate change to Big Tech, The",
      "Trump insists neither Russia nor Ukraine are playing’ him as peace talks continue httpswww.europesays.com2007177 Your support helps us to tell the story From reproductive rights to climate change to Big Tech, The"
    ]
  },
  {
    "Topic": 15,
    "Count": 422,
    "Name": "15_nature_our_to_schools",
    "Representation": [
      "nature",
      "our",
      "to",
      "schools",
      "for",
      "and",
      "the",
      "april",
      "your",
      "in"
    ],
    "Representative_Docs": [
      "I spent my morning doing clean-up at Boom Island Park did you know that today's Earth Day Clean-Up is the largest community service project in Minneapolis? It's a good reminder of what we can get done when we work together. Thanks to everyone who came out to help!",
      "City Nature Challenge is drawing closer. Take part in your back garden, local greenspace or join us at one of our events tinyurl.comCNC2025Journ... By taking part you could win a prize, which will help you in your future recording efforts!",
      "Take action this Earth Day by joining us on our litter pick! It’s a great way to give back to your community whilst learning about the volunteering opportunities we offer. Click here for more details tinyurl.com5y9mbnw5 Please register here tinyurl.com5n87h26u We hope to see you there!"
    ]
  },
  {
    "Topic": 16,
    "Count": 410,
    "Name": "16_china_solar_chinese_tariffs",
    "Representation": [
      "china",
      "solar",
      "chinese",
      "tariffs",
      "evs",
      "panels",
      "tariff",
      "ev",
      "us",
      "the"
    ],
    "Representative_Docs": [
      "It is not in our best interest to put high tariffs on things like solar panels. Biden imposed 270% tariffs on solar panels to TRY save US production. It literally could kill the industry. Trumps doing same. China is producing cheaper solar long term results will serve to help climate change",
      "apnews.comarticletrum... dominates solar. Trump tariffs target China. For US solar industry, that means higher costs",
      "China dominates solar. Trump tariffs target China. For US solar industry, that means higher costs \"China accounted for at least 80% of the components of solar panels as recently as 2022, especially polysilicon, glass and solar cells.\" www.msn.comen-usmoney..."
    ]
  },
  {
    "Topic": 17,
    "Count": 325,
    "Name": "17_africa_african_africas_energy",
    "Representation": [
      "africa",
      "african",
      "africas",
      "energy",
      "south",
      "in",
      "solar",
      "power",
      "climate",
      "renewable"
    ],
    "Representative_Docs": [
      "However, Africa is blessed with an abundance of clean renewable energy potential. The continent has untapped wind and solar power resources that could be harnessed to become a global leader in clean energy. Countries such as Morocco, Kenya, and South Africa are already making strides in",
      "Intra-African Trade, Investment and Liquefied Petroleum Gas LPG can Address Africa’s 15B Infrastructure Gap Africa.com httpswww.europesays.com1977287 NJ Ayuk, Executive Chairman of the African Energy Chamber AEC www.EnergyChamber.org, has called for greater utilization of African",
      "Intra-African Trade, Investment and Liquefied Petroleum Gas LPG can Address Africa’s 15B Infrastructure Gap Africa.com httpswww.europesays.com1977287 NJ Ayuk, Executive Chairman of the African Energy Chamber AEC www.EnergyChamber.org, has called for greater utilization of African"
    ]
  },
  {
    "Topic": 18,
    "Count": 314,
    "Name": "18_salmon_fish_ocean_algae",
    "Representation": [
      "salmon",
      "fish",
      "ocean",
      "algae",
      "fishing",
      "oxygen",
      "marine",
      "acidification",
      "seafood",
      "the"
    ],
    "Representative_Docs": [
      "A federal judge just hit the brakes on Trump’s plan to fast-track industrial fish farming in the Gulf. Advocates for marine health say aquaculture \"has no place in U.S. ocean waters.\" grist.orgfood-and-agr... Gulf Climate Fish Shrimp Agriculture MarineLife",
      "Drug pollution in water is making salmon take more risks - new research -The Conversation Salmon Pollution Water More info from EcoSearch",
      "A federal judge just hit the brakes on Trump’s plan to fast-track industrial fish farming in the Gulf. Advocates for marine health say aquaculture \"has no place in U.S. ocean waters.\" grist.orgfood-and-agr... Ocean Fishing Seafood Climate Marine"
    ]
  },
  {
    "Topic": 19,
    "Count": 282,
    "Name": "19_use_peroxide_cleaning_reg",
    "Representation": [
      "use",
      "peroxide",
      "cleaning",
      "reg",
      "promo",
      "code",
      "cleaner",
      "amazon",
      "hydrogen",
      "clean"
    ],
    "Representative_Docs": [
      "4-in-1 Cleaning Kit for 4.50, reg 8.99! -- Use Promo Code 50NGJMOM",
      "Electric Spin Scrubber, 2025 Upgrade 7 in 1 Powerful Cleaning 35% off, DEAL price 19.44, reg 29.9. -- Use promo code 35FEB4ZZ Buy on Amazon",
      "Car Detailing Brush Set for Interior Cleaning - No Scratch 50% off, DEAL price 4.49, reg 8.99. -- Use promo code 6MHDZYO6 Buy on Amazon"
    ]
  },
  {
    "Topic": 20,
    "Count": 281,
    "Name": "20_drill_fracking_baby_oil",
    "Representation": [
      "drill",
      "fracking",
      "baby",
      "oil",
      "drilling",
      "the",
      "to",
      "energy",
      "for",
      "is"
    ],
    "Representative_Docs": [
      "Drill baby drill for heat. Does no one do whole system economics?",
      "Climate change Global warming is a hoax drill baby drill burn baby burn",
      "Climate change Global warming is a hoax drill baby drill burn baby burn"
    ]
  },
  {
    "Topic": 21,
    "Count": 280,
    "Name": "21_florida_california_waterfront_chemtrails",
    "Representation": [
      "florida",
      "california",
      "waterfront",
      "chemtrails",
      "property",
      "state",
      "the",
      "in",
      "berkeley",
      "climate"
    ],
    "Representative_Docs": [
      "Doesn’t seem a good idea for Trump’s home in Florida given Florida is a favored target of severe weather like, you know, hurricanes. But then it does have the word climate in it which is a Trump no-no.",
      "Yall Florida getting wilder! FL reps cracking down on chemtrails to freethesun is anything real anymore?! DeSantis People have a lot of kooky ideas that they can get in and put things in the atmosphere to block the sun and save us from climate change. We're not playing that game in Florida",
      "Seeing and feeling how fierce Hurricane Milton was, it's only a matter of time before Florida goes under. DeSantis doesn't want anyone to talk about climate change They fired the man that helped Florida's coast become more resilient to storms in the fed firings. Florida is fucked."
    ]
  },
  {
    "Topic": 22,
    "Count": 276,
    "Name": "22_wood_my_to_heat",
    "Representation": [
      "wood",
      "my",
      "to",
      "heat",
      "it",
      "roofs",
      "windows",
      "the",
      "have",
      "and"
    ],
    "Representative_Docs": [
      "considering the proximity to the big mass timber industry out there, i would think it would be not at all more expensive. and durability? why thats almost the best climate to build it out of wood",
      "idk, i thought wood would just be warmer than stone, in general. doesn’t it being alive help? lol. i don’t really buy the dark trunks theory, bc how does the sun get to the trunk that’s under the snow to heat it up? but i would buy that wood absorbs heat from the air and conducts it through.",
      "The climate issue aside this is a stupid idea. Why? Because we don't even have the right wood. Our climate as a whole in the country would not have the right type of wood to create houses or whatever we need. It's too wet and doesn't get cold enough like Canada does.1"
    ]
  },
  {
    "Topic": 23,
    "Count": 251,
    "Name": "23_2025_project_is_the",
    "Representation": [
      "2025",
      "project",
      "is",
      "the",
      "2030",
      "to",
      "be",
      "it",
      "2050",
      "of"
    ],
    "Representative_Docs": [
      "According to the Project 2025 Tracker site, implementation of Project 2025 is now at 42%.",
      "From this website, you can track which Project 2025 policies have been implemented by the guy who said he had nothing to do with Project 2025.",
      "Taking control of school curriculums is part of Project 2025. Destroying unions is part of Project 2025. Fucking over your retirement is part of Project 2025. Destroying the environment is part of Project 2025. Nuclear war is part of Project 2025. Reconsidering alliances is part of Project 2025."
    ]
  },
  {
    "Topic": 24,
    "Count": 222,
    "Name": "24_air_purifier_filters_hepa",
    "Representation": [
      "air",
      "purifier",
      "filters",
      "hepa",
      "purifiers",
      "ventilation",
      "filter",
      "urban",
      "indoor",
      "dehumidifier"
    ],
    "Representative_Docs": [
      "The best air purifier for a baby nursery is the LEVOIT Air Purifier. It effectively filters out airborne pollutants and provides temperature control. Keeping the air clean and safe for the health and well-being of your child is crucial. petershamproperties.combest-air-pur...",
      "More N95s to filter out the impending coal in the air. HEPA filters for the air system. Air purifiers and several extra filters. And a whole bunch of activists and donors to get these things to people.",
      "2. If the outdoor air is polluted, use air purifiers. Air purifiers with HEPA filters are a great option to clean the air and reduce particles that could affect your health."
    ]
  },
  {
    "Topic": 25,
    "Count": 211,
    "Name": "25_bitcoin_lithium_crypto_mining",
    "Representation": [
      "bitcoin",
      "lithium",
      "crypto",
      "mining",
      "nickel",
      "blockchain",
      "is",
      "the",
      "batteries",
      "of"
    ],
    "Representative_Docs": [
      "As we shift to clean energy, the demand for nickel, cobalt, lithium copper is soaringbut at what cost? Join us at SFClimateWeek to explore the human environmental toll of mining transition minerals how we can build a just, rights-respecting transition. Register here lu.marpccu8fq",
      "As we shift to clean energy, the demand for nickel, cobalt, lithium copper is soaringbut at what cost? Join us at SFClimateWeek to explore the human environmental toll of mining transition minerals how we can build a just, rights-respecting transition. Register lu.marpccu8fq",
      "As we shift to clean energy, the demand for nickel, cobalt, lithium copper is soaringbut at what cost? Join us to explore the human environmental toll of mining transition minerals how we can build a just, rights-respecting transition. Register lu.marpccu8fq"
    ]
  },
  {
    "Topic": 26,
    "Count": 208,
    "Name": "26_xai_memphis_generators_musks",
    "Representation": [
      "xai",
      "memphis",
      "generators",
      "musks",
      "turbines",
      "elon",
      "methane",
      "35",
      "facility",
      "using"
    ],
    "Representative_Docs": [
      "Guardian - Elon Musk’s xAI powering its facility in Memphis with illegal’ generators Advocacy group says the firm has doubled the number of methane gas burning turbines it’s using without permits.",
      "Elon Musk’s xAI powering its facility in Memphis with illegal’ generators. Advocacy group says the firm has doubled the number of methane gas burning turbines it’s using without permits.",
      "Elon Musk’s xAI powering its facility in Memphis with illegal’ generators Advocacy group says the firm has doubled the number of methane gas burning turbines it’s using without permits httpswww.europesays.com1983691 Elon Musk’s xAI powering its facility in Memphis with illegal’"
    ]
  },
  {
    "Topic": 27,
    "Count": 207,
    "Name": "27_car_diesel_cars_electric",
    "Representation": [
      "car",
      "diesel",
      "cars",
      "electric",
      "tyres",
      "to",
      "the",
      "coal",
      "it",
      "they"
    ],
    "Representative_Docs": [
      "You're gonna view a group as a bunch of idiots if they were to prop up a guy who knows nothing about cars and advocating for car regulations and using incorrect terminology over emissions and they cant even get the parts of the car that need inspections on right",
      "Let's not forget that air pollution comes from car tyres as well as tailpipes - so even if everyone drove an electric car there'd still be pollution and of course congestion.",
      "Imagine what that 12 car would do in clean air and what that 24 car will do in dirty air"
    ]
  },
  {
    "Topic": 28,
    "Count": 192,
    "Name": "28_apr_additional_details_cdt",
    "Representation": [
      "apr",
      "additional",
      "details",
      "cdt",
      "iembot",
      "issues",
      "pm",
      "alert",
      "at",
      "mdt"
    ],
    "Representative_Docs": [
      "FSD issues Air Quality Alert AQA at Apr 16, 125 PM CDT at Wed, 16 Apr 2025 182544 0000 via IEMbot Additional Details Here.",
      "FSD issues Air Quality Alert AQA at Apr 17, 140 PM CDT at Thu, 17 Apr 2025 184025 0000 via IEMbot Additional Details Here.",
      "GID issues Air Quality Alert AQA at Apr 17, 1214 PM CDT at Thu, 17 Apr 2025 171521 0000 via IEMbot Additional Details Here."
    ]
  },
  {
    "Topic": 29,
    "Count": 189,
    "Name": "29_easter_chocolate_cocoa_eggs",
    "Representation": [
      "easter",
      "chocolate",
      "cocoa",
      "eggs",
      "wildlifephotography",
      "birdsseenin2025",
      "markscheflencom",
      "birdphotography",
      "twitternaturephotography",
      "wildlifeplanet"
    ],
    "Representative_Docs": [
      "Easter chocolate cocoa price up a third as extreme weather and climate change bite - less for more’ imports to UK down as price per kilo rises. eciu.netmediapress-...",
      "EASTER EASTER EASTER EASTER EASTER EASTER EASTER EASTER EASTER NO THOUGHTS JUST BUNNY JESUS EGG HATCHING VIBES",
      "Easter chocolate cocoa price up a third as extreme weather and climate change bite eciu.netmediapress-..."
    ]
  },
  {
    "Topic": 30,
    "Count": 179,
    "Name": "30_smell_smells_oxide_nitrous",
    "Representation": [
      "smell",
      "smells",
      "oxide",
      "nitrous",
      "sulphur",
      "it",
      "that",
      "the",
      "like",
      "you"
    ],
    "Representative_Docs": [
      "Speaking of sulfur, I remember when I went to Iceland and I took my first shower in the hotel, I was like why does it smell like eggs? But then I read that because the water is heated by geothermal energy and that smell goes away after running the water for a few minutes.",
      "In the 90s, you'd smell for gas and stuff. These days, you smell if it's gassy stuff.",
      "If your fridge smells bad you can, after cleaning up what made it smell, put a glass of carbonated water in it and it will absorb the smell. Not sure if it helps everyone but this has worked for me in the past such as when a container have leaked inside the fridge."
    ]
  },
  {
    "Topic": 31,
    "Count": 154,
    "Name": "31_pollen_allergies_allergy_hay",
    "Representation": [
      "pollen",
      "allergies",
      "allergy",
      "hay",
      "fever",
      "change",
      "worse",
      "seasons",
      "longer",
      "wwwbbccomfutureartic"
    ],
    "Representative_Docs": [
      "Yes, global warming is making pollen allergies worse. Warmer temperatures are causing plants to release more pollen, start earlier, and have longer growing seasons, resulting in longer and more intense allergy seasons. Increased carbon dioxide levels also stimulate plants to produce more pollen. AI",
      "Climate change is supercharging pollen allergies this is how shorturl.atqxsFF.",
      "Climate change is supercharging pollen allergies Seasonal allergy sufferers are being hit with more pollen over a longer season due to rising temperatures, but global warming is also triggering alarming extreme allergy events bbc.comfutureartic..."
    ]
  },
  {
    "Topic": 32,
    "Count": 147,
    "Name": "32_bees_bee_honey_are",
    "Representation": [
      "bees",
      "bee",
      "honey",
      "are",
      "pollinators",
      "pesticides",
      "honeybee",
      "wwwnytimescom20250412b",
      "of",
      "flowers"
    ],
    "Representative_Docs": [
      "DECLINE IN HONEY BEES University scientists said honey bee colonies could decline by up to 70% this year 2025. Climate Change and Pesticides are some of the MAJOR factors yet here we are ignoring this issue UNTIL IT WILL BE TOO LATE! bees theworldisending earth weareintrouble",
      "This is so interesting I never knew honey bees were not native to USA bees pollinators climate nature",
      "There is fantastic discussion going on with everyone about the welfare of bees, climate change wild bees vs agricultural honey bees. The more we talk about things going on the better. I do want to promote healthy discussions about solutions to issues of this nature rather than bickering."
    ]
  },
  {
    "Topic": 33,
    "Count": 144,
    "Name": "33_biofuel_biofuels_biodiesel_palm",
    "Representation": [
      "biofuel",
      "biofuels",
      "biodiesel",
      "palm",
      "fuel",
      "biogas",
      "oil",
      "virgin",
      "diesel",
      "hvo"
    ],
    "Representative_Docs": [
      "The issue is that in the UN reporting biofuel is biofuel irrespective of quality, as the land use effects are to be accounted in the land sector which may be in a different country. So there’s little incentive to pay eg twice the price of diesel for HVO.",
      "UK investigating claims green fuel contains virgin palm oil au.news.yahoo.comuk-investiga... via YahooNewsAU UK investigating claims green fuel contains virgin palm oil The BBC finds evidence of fraud in the production of a \"green\" diesel meant to cut emissions.",
      "More evidence of biofuel fraud New study by Transport Environment shows that twice as much feedstock declared as Palm Oil Mill Effluent POME is being used in biofuels globally than can possibly exist. Virgin palm oil being mislabelled as a 'residue' www.transportenvironment.orgarticlespal..."
    ]
  },
  {
    "Topic": 34,
    "Count": 144,
    "Name": "34_golf_courses_course_masters",
    "Representation": [
      "golf",
      "courses",
      "course",
      "masters",
      "solar",
      "farms",
      "land",
      "play",
      "water",
      "the"
    ],
    "Representative_Docs": [
      "This is actually a good point. Replace the golf courses with solar farms!",
      "Get rid of some golf courses then. Energy is essential, food is essential, golf is fun.",
      "and tbh fuck golf it looks boring too. we have mini golf and we’re fine w that. and don’t get me started on how golf courses are so bad for the environment"
    ]
  },
  {
    "Topic": 35,
    "Count": 144,
    "Name": "35_funny_climate_joke_comedians",
    "Representation": [
      "funny",
      "climate",
      "joke",
      "comedians",
      "political",
      "it",
      "warming",
      "like",
      "me",
      "laugh"
    ],
    "Representative_Docs": [
      "The job of comedians is to take the current climate and make jokes about it to remind us all how insane or inane it all is. I appreciate all of you who can make me laugh right now.",
      "It's so funny to see the swaths of people still dead set on trying to paint the current political climate as \"just a difference of opinion\" STILL dying on that hill. But not \"ha ha\" funny. In fact, those people are very clearly the most dangerous group of them all imho.",
      "It’s very funny that they used to scream at us about like climate change and how we hadn’t done enough to stop it and then a majority of them voted for a fascist who doesn’t believe in climate change and now we are in hell together! I mean it’s not laugh out loud funny."
    ]
  },
  {
    "Topic": 36,
    "Count": 138,
    "Name": "36_nz_nzpol_zealand_new",
    "Representation": [
      "nz",
      "nzpol",
      "zealand",
      "new",
      "newsweather",
      "zealands",
      "bots",
      "native",
      "report",
      "emissions"
    ],
    "Representative_Docs": [
      "NZ Green Party nzpol We are building a future where we do more, faster, to protect our planet and make sure everyone is treated equally. more newsweather bots",
      "NZ Green Party nzpol We are building a future where we do more, faster, to protect our planet and make sure everyone is treated equally. more newsweather bots",
      "NZ Green Party nzpol We are building a future where we do more, faster, to protect our planet and make sure everyone is treated equally. more newsweather bots"
    ]
  },
  {
    "Topic": 37,
    "Count": 133,
    "Name": "37_concentration_camps_salvador_hague",
    "Representation": [
      "concentration",
      "camps",
      "salvador",
      "hague",
      "el",
      "camp",
      "cecot",
      "sent",
      "is",
      "you"
    ],
    "Representative_Docs": [
      "45 Billion to Expand Concentration Camps. Concentration camps.",
      "Building 5 more offshore, \"TRUMP\" Concentration Camps in El Salvador!",
      "Concentration Camps. They're basically talking about Concentration Camps."
    ]
  },
  {
    "Topic": 38,
    "Count": 133,
    "Name": "38_feel_im_my_depression",
    "Representation": [
      "feel",
      "im",
      "my",
      "depression",
      "environment",
      "to",
      "that",
      "it",
      "you",
      "and"
    ],
    "Representative_Docs": [
      "What seems to have been lost during this age of the individual self... is that what you are, how you feel, and what you do are not just things that merely come from within you... but crucially, they come from your environment and your position in the power structure that surrounds you.",
      "the political climate is scary and sucks but i don’t feel demotivated or burnt out by it? maybe it’s privilege but i think it’s also this feeling of, like, whatever happens, i wanna do what i can to help. Things can bad but it’s not making me feel despair, it’s making me feelcreative? focused?",
      "Anxiety and depression are ruling my life right now, and with everything that's happened in the last so many months not just the political climate, my walls are broken down and I can't hold the line anymore. But I will not throw in the towel. I can't."
    ]
  },
  {
    "Topic": 39,
    "Count": 131,
    "Name": "39_art_music_sound_of",
    "Representation": [
      "art",
      "music",
      "sound",
      "of",
      "and",
      "the",
      "nature",
      "to",
      "creative",
      "artists"
    ],
    "Representative_Docs": [
      "7 Powerful Street Art Pieces Fighting for the Planet httpsstreetartutopia.com20250331street-art-that-echo-environmental-awareness",
      "More! 7 Powerful Street Art Pieces Fighting for the Planet httpsstreetartutopia.com20250331street-art-that-echo-environmental-awareness",
      "I think my old art teachers would be happy to hear I'm getting back into art. Especially my high school art teacher. He said I had a lot of potential, and was sad to see that I had to drop out of school due to how toxic the environment was."
    ]
  },
  {
    "Topic": 40,
    "Count": 130,
    "Name": "40_esg_ecosearch_from_info",
    "Representation": [
      "esg",
      "ecosearch",
      "from",
      "info",
      "sustainability",
      "value",
      "investors",
      "reporting",
      "investing",
      "chain"
    ],
    "Representative_Docs": [
      "ESG Regulation in the European Union -Lexology ESG More info from EcoSearch",
      "'ESG is a form of risk management, not a woke activity' -Interest ESG More info from EcoSearch",
      "ESG Book, BCG Launch New Sustainability Reporting Platform -ESG Today Sustainability ESG More info from EcoSearch"
    ]
  },
  {
    "Topic": 41,
    "Count": 124,
    "Name": "41_gaza_palestine_israel_genocide",
    "Representation": [
      "gaza",
      "palestine",
      "israel",
      "genocide",
      "climate",
      "the",
      "change",
      "palestinians",
      "and",
      "in"
    ],
    "Representative_Docs": [
      "climateliberation.bsky.social Please share To the free people of the world and all supporters of Gaza and Palestine,donate one euro to me and my family.It will give us more strength and steadfastness in the face of the occupation. Palestine Help Gaza Donate www.gofundme.comfhelp-nidal...",
      "Emissions from Israel's war in Gaza have an 'immense' effect on climate catastrophe. The first few months of the Zionist attacks on Gaza produced more planet-warming gases than 20 climate-vulnerable nations do in one year. climatechange",
      "We have no access to a clean environment here in Gaza. Our children will all get sick because of the sewage and the severe environmental pollution in Gaza. Please help us evacuate Gaza. Please help us live in safety. Gaza Palstain"
    ]
  },
  {
    "Topic": 42,
    "Count": 123,
    "Name": "42_transition_neutral_problems_neutrality",
    "Representation": [
      "transition",
      "neutral",
      "problems",
      "neutrality",
      "be",
      "there",
      "cost",
      "will",
      "timeline",
      "beautiful"
    ],
    "Representative_Docs": [
      "Trump There will be transition costs and transition problems.",
      "Trump \"There will be a transition cost and transition problems.\"",
      "Trump \"There will be a transition cost and transition problems.\""
    ]
  },
  {
    "Topic": 43,
    "Count": 116,
    "Name": "43_rice_arsenic_toxic_change",
    "Representation": [
      "rice",
      "arsenic",
      "toxic",
      "change",
      "levels",
      "worlds",
      "grain",
      "climate",
      "staple",
      "arstechnicacomscience2025"
    ],
    "Representative_Docs": [
      "Climate change is quietly turning the world’s most important crop toxic. Rising CO2 temperatures increase inorganic arsenic in rice, a staple food for billions. Climate change will make rice toxic, say researchers.",
      "\"Climate change will make rice toxic, say researchers. Warmer temperatures and increased carbon dioxide will boost arsenic levels in rice.\"",
      "New research Climate change will make rice toxic, say researchers. Warmer temperatures and increased carbon dioxide will boost arsenic levels in rice. insideclimatenews.orgnews1604202... food health climatechange"
    ]
  },
  {
    "Topic": 44,
    "Count": 116,
    "Name": "44_geoengineering_solar_we_is",
    "Representation": [
      "geoengineering",
      "solar",
      "we",
      "is",
      "solution",
      "it",
      "the",
      "to",
      "not",
      "stop"
    ],
    "Representative_Docs": [
      "This is really important. Do NOT talk about solar geoengineering as a climate \"solution.\" 1n",
      "A major problem is that we are aggressively geoengineering and have been for two centuries. What we fail to discuss is that we need to STOP geoengineering completely. We are aggressively geoengineering - adding vast quantities of carbon dioxide and methane to the atmosphere.",
      "Solar geoengineering moves into the spotlight as climate concerns grow -Science News Climate Geoengineering More info from EcoSearch"
    ]
  },
  {
    "Topic": 45,
    "Count": 115,
    "Name": "45_peat_peatlands_peatland_peatfree",
    "Representation": [
      "peat",
      "peatlands",
      "peatland",
      "peatfree",
      "colombias",
      "bogs",
      "carbon",
      "heather",
      "of",
      "and"
    ],
    "Representative_Docs": [
      "Go peat-free in your gardening. Boglands make up about 3% of land on Earth, but they store twice as much carbon as all the world's forests combined. They are vital carbon sinks and ecosystems. We must protect them, re-wet and restore them. Bogs Peat",
      "We're dedicated to lobbying for legislation to end the sale and supply of peat. But why is that necessary? What even is peat? See our explainer about why peat-free is essential for protecting nature and climate peatfreepartnership.org.ukwhy-peat-free GardenSky Gardening PeatFree",
      "We're dedicated to lobbying for legislation to end the sale and supply of peat. But why is that necessary? See our explainer about why peat-free is essential for protecting nature and climate peatfreepartnership.org.ukwhy-peat-free GardenSky Gardening PeatFree"
    ]
  },
  {
    "Topic": 46,
    "Count": 110,
    "Name": "46_rng_prince_game_you",
    "Representation": [
      "rng",
      "prince",
      "game",
      "you",
      "rooms",
      "blue",
      "it",
      "that",
      "im",
      "the"
    ],
    "Representative_Docs": [
      "I’m only about 40 hours in and just rolled credits. There’s a lot more I can and will do, but another 60 hours does seem like a lot! The RNG is really what makes it take a while. You have to have knowledge tools resources RNG luck to get the rooms you need.",
      "Saw Blue Prince has a 79% on steam and the common negative complaint is RNG and I have to agree with it. Now I dislike RNG more so cause I played Hearthstone for years and had enough RNG in my lifetime. Kept getting rooms and not having gems to open or getting dead ends, or not having a key.",
      "WE HAVE AN RNG EMERGENCY - I REPEAT, WE HAVE AN RNG EMRGENCY"
    ]
  },
  {
    "Topic": 47,
    "Count": 108,
    "Name": "47_feed_april_2025_reneweconomy",
    "Representation": [
      "feed",
      "april",
      "2025",
      "reneweconomy",
      "by",
      "herald",
      "wednesday",
      "on",
      "thursday",
      "footballs"
    ],
    "Representative_Docs": [
      "Feed \"RenewEconomy\" By Rachel Williamson on Wednesday, April 16, 2025",
      "Feed \"RenewEconomy\" By Rachel Williamson on Wednesday, April 9, 2025",
      "Feed \"RenewEconomy\" By Rachel Williamson on Wednesday, April 16, 2025"
    ]
  },
  {
    "Topic": 48,
    "Count": 106,
    "Name": "48_card_green_greencard_holder",
    "Representation": [
      "card",
      "green",
      "greencard",
      "holder",
      "holders",
      "cards",
      "they",
      "wwweb5choicecomusgreencar",
      "us",
      "this"
    ],
    "Representative_Docs": [
      "How would a Green Card holder even check to see it hasn’t happened to them?",
      "Green card? I don't have to show you no stinking green card.",
      "Green card status in our records I mean not the green card itself."
    ]
  }
]