[
  {
    "Topic": -1,
    "Count": 69703,
    "Name": "-1_the_to_and_of",
    "Representation": [
      "the",
      "to",
      "and",
      "of",
      "in",
      "for",
      "is",
      "climate",
      "on",
      "that"
    ],
    "Representative_Docs": [
      "Clean air, healthy food, clean water, diverse ecosystem and a healthy ecology is my only option. All of this because we, Serbs, want to leave to our children what they deserve. This nature is not ours to give, it belongs to them and all of those that will come after them.",
      "A tiny of people own all the rights to a natural resource that mostly cannot be used in any other way except to harm human beings whether as straight up poison or climate change they absolutely will not stop until every last drop of their investment is in our lungs, brains, or the atmosphere",
      "If we know aether is a real thing and you can get electricity from the atmosphere then THEY know as well. Whether they let us know they know or not. Which means they are utilising it and charging us for free energy - because it's there. That's what they do."
    ]
  },
  {
    "Topic": 0,
    "Count": 7396,
    "Name": "0_climate_change_the_he",
    "Representation": [
      "climate",
      "change",
      "the",
      "he",
      "is",
      "to",
      "that",
      "and",
      "of",
      "it"
    ],
    "Representative_Docs": [
      "Wait..so does this mean he believes in Climate Change...but can't bring himself to say that is exacerbating and increasing extreme weather events? So..he understands Climate Change is real...but not that it has an affect?",
      "For those with a brain, this is catastrophic. It's no longer whether or not you believe in climate change, it's whether or not you UNDERSTAND climate change. For anybody in this current administration that wants to bring back coal and clear-cut public lands - FUCK ALL THE WAY OFF",
      "This is how stupid Trump is. He thinks this is only related to climate change. It's related how to continue our way of life with the changes in the climate that we're facing. The climate has been changing since the beginning of time but humans have just recently learned how to study it prepare"
    ]
  },
  {
    "Topic": 1,
    "Count": 7083,
    "Name": "1_canada_the_to_tax",
    "Representation": [
      "canada",
      "the",
      "to",
      "tax",
      "carney",
      "and",
      "auspol",
      "climate",
      "carbon",
      "is"
    ],
    "Representative_Docs": [
      "The shoddy thing is that Peter Dutton has always known about the effects of climate change. Remember when he said \"time doesn't mean anything when you're about to have water lapping at your door\" about Pacific leaders? He believes the science, but climate change is just a joke to him. auspol",
      "What Canada needs now is a national electricity grid. Liberal Leader Mark Carney made what might be the most significant environmental and energy policy proposal of the federal election campaign so far. www.nationalobserver.com20250410o...",
      "Absolutely Canada. Talk to all your neighbours, friends and family as to how important this election is. Canada faces a nasty threat from Trump and really absolutely the only leader that can fight this is CARNEY. PP is a carbon copy of Trump and will bow down to Trump in no time. CARNEY FOR PM."
    ]
  },
  {
    "Topic": 2,
    "Count": 4820,
    "Name": "2_coal_clean_trump_plants",
    "Representation": [
      "coal",
      "clean",
      "trump",
      "plants",
      "to",
      "is",
      "the",
      "and",
      "power",
      "mercury"
    ],
    "Representative_Docs": [
      "Coal that has been there , just being there , a different kind of coal, actually nobody has ever seen coal like this before.",
      "\"Clean Beautiful Coal\" my A! insideclimatenews.orgnews1104202...",
      "Anyone who thinks coal is beautiful andor clean has never been near a coal mine, coal processing plant, or coal-fueled machinery."
    ]
  },
  {
    "Topic": 3,
    "Count": 3254,
    "Name": "3_ai_data_the_energy",
    "Representation": [
      "ai",
      "data",
      "the",
      "energy",
      "and",
      "to",
      "of",
      "use",
      "it",
      "centers"
    ],
    "Representative_Docs": [
      "Will Somebody please ask AI to figure out how to do AI without such extreme energy use? Like maybe 10% of what it takes now?",
      "It is easy to hate on AI but the fundamental issue is the same. Making our energy sources green. AI driving up data centres power use may trigger a mini green revolution. I do also think AI power requirements may perhaps decrease as AI evolves such as CRT to LCD screens.",
      "Electricity demand will skyrocket because of AI and data centres. The web, and AI in particular, is the leading environmental issue of our time. Your tech choices have an impact, even if you can’t see them from your desk."
    ]
  },
  {
    "Topic": 4,
    "Count": 3025,
    "Name": "4_trump_climate_noaa_state",
    "Representation": [
      "trump",
      "climate",
      "noaa",
      "state",
      "weather",
      "laws",
      "order",
      "states",
      "to",
      "research"
    ],
    "Representative_Docs": [
      "Why Trump’s executive order targeting state climate laws is probably illegal Climate",
      "Why Trump’s executive order targeting state climate laws is probably illegal Climate",
      "Trump signed an executive order that aims to reduce the use of fossil fuels and combat climate crisis per The Guardian. Trump’s executive order targets state laws on carbon taxes and fees, as well as state laws that mention terms including environmental justice and greenhouse gas emissions."
    ]
  },
  {
    "Topic": 5,
    "Count": 2789,
    "Name": "5_ev_cars_evs_car",
    "Representation": [
      "ev",
      "cars",
      "evs",
      "car",
      "electric",
      "tesla",
      "to",
      "the",
      "and",
      "charging"
    ],
    "Representative_Docs": [
      "CarDriver 2025 best EV Tesla Model 3 1010 rating And, so what That is not the point The point is we need to replace ICE cars with EV's and minimize pollution from burning fossil fuels Ending Tesla cuz Elon is a nazi shit is stupid in the face of Climate Change",
      "That's convenient! Having more charging stations around can definitely make life easier, especially with the growing number of electric vehicles on the road. Boardman's getting some nice upgrades! Are you an EV owner yourself, or are you just happy to see the infrastructure improving?",
      "But - a reminder to everyone - don't trade in your Tesla for a combustion car. If you want to make an ethical choice gas, diesel and hybrid cars are NOT ETHICAL at all. Go electric!"
    ]
  },
  {
    "Topic": 6,
    "Count": 2665,
    "Name": "6_nuclear_fossil_lng_energy",
    "Representation": [
      "nuclear",
      "fossil",
      "lng",
      "energy",
      "gas",
      "fuels",
      "the",
      "fuel",
      "germany",
      "to"
    ],
    "Representative_Docs": [
      "Nuclear and renewables do not need to coexist. The only reason nuclear is being discussed at all is to prop up the fossil fuel industries.",
      "It's a bit worse than that, in that in multiple places in the EU they're now using even MORE fossil fuels Coal as a major issue, and the desire to return to using Russian oil and natural gas because of their refusal to use nuclear.",
      "5. Energy security. needs to reduce its reliance on fossil fuel imports. is the dominant supplier of LNG to which they can leverage. As new LNG pipelines are being constructed from the Middle East. It terms of statigic autonomy, the only solution ATM is nuclear energy renewable energy."
    ]
  },
  {
    "Topic": 7,
    "Count": 2525,
    "Name": "7_climate_the_and_of",
    "Representation": [
      "climate",
      "the",
      "and",
      "of",
      "book",
      "on",
      "to",
      "for",
      "in",
      "this"
    ],
    "Representative_Docs": [
      "hey hey my climate change book about the power of humanity and love and joy persisting is OUT and you can READ IT on multiple platforms!!! or ask for it at your library or indie bookstore!!! get it here request specifically from Clintonville Books for a signed copy!",
      "I'm gonna have to look this stuff up. I want to say that Climate Town or the podcast Climate Deniers Playbook talked about desalination and why we're not doing it, but it might have been another podcast",
      "Thanks! I've been doing a bunch of book talks on my own in recent months, so I'm excited to get the chance to have a conversation with someone who really knows the science behind pollution climate change"
    ]
  },
  {
    "Topic": 8,
    "Count": 2514,
    "Name": "8_solar_panels_power_electricity",
    "Representation": [
      "solar",
      "panels",
      "power",
      "electricity",
      "battery",
      "the",
      "of",
      "energy",
      "in",
      "to"
    ],
    "Representative_Docs": [
      "Nor would I. I also will never use Starlink, Tesla batteries for home or Tesla solar panels. I currently have a pv system that uses Canadian Solar panels.",
      "yes, just to power it and if you want, to program it. You can also use a battery or solar panel.",
      "Try REA Solar. They do solar panels and batteries. Their solar panels each have mini inverters and use AC power. No need for a separate inverter to run them. My 10 kW battery from them cost 8K installed and it's great."
    ]
  },
  {
    "Topic": 9,
    "Count": 2437,
    "Name": "9_plastic_waste_plastics_microplastics",
    "Representation": [
      "plastic",
      "waste",
      "plastics",
      "microplastics",
      "recycling",
      "and",
      "the",
      "to",
      "of",
      "in"
    ],
    "Representative_Docs": [
      "\"While China is the biggest producer and consumer of plastic, Americans consume the most plastic per head, the equivalent of 216kg per person a year. The US produces 40.1 megatonnes Mt of plastic waste most of it from plastic packaging\".",
      "microplastics can be significantly reduced if the main source is reduced such as plastic pellets, plastic water bottles, plastic one use bags, Styrofoam it is impossible to clean up once in the environment",
      "Plastic rain. There is plastic in the rain. And there is plastic in our brains. Do we have plastic thoughts?"
    ]
  },
  {
    "Topic": 10,
    "Count": 2380,
    "Name": "10_carbon_co2_emissions_methane",
    "Representation": [
      "carbon",
      "co2",
      "emissions",
      "methane",
      "capture",
      "the",
      "of",
      "is",
      "in",
      "to"
    ],
    "Representative_Docs": [
      "\"Like carbon dioxide, methane can either collect in the planet’s atmosphere as a greenhouse gas or it can be captured and utilized. Unlike carbon dioxide, methane is an easily usable fuel. Unfortunately, it also has to be captured at its source and the sources are many.\"",
      "If Carbon is the material of the future and we have so much of it in the atmosphere, why are plants not being prioritised to gather and process carbon dioxide into carbon and oxygen?",
      "FACT 1 Carbon Dioxide \"Co2\" is the main contributor to Global Climate Change. FACT 2 Co2 in the atmosphere is still increasing. climate.nasa.govvital-signs..."
    ]
  },
  {
    "Topic": 11,
    "Count": 2349,
    "Name": "11_space_shipping_emissions_the",
    "Representation": [
      "space",
      "shipping",
      "emissions",
      "the",
      "to",
      "ships",
      "of",
      "carbon",
      "on",
      "for"
    ],
    "Representative_Docs": [
      "And there you have it, major shipping nations have agreed that to help fund the greening of shipping that a global emissions fee should be assessed...",
      "shipping without US apnews.comarticleship... Major nations agree on first-ever global fee on greenhouse gases with plan that targets shipping",
      "Countries agree to global carbon tax on shipping, opposed by Trump The agreement, which the Trump administration opposes, makes the shipping industry the first to face international binding emissions targets. httpswww.europesays.com1988312 Countries agree to global carbon tax on"
    ]
  },
  {
    "Topic": 12,
    "Count": 2324,
    "Name": "12_food_farmers_meat_farming",
    "Representation": [
      "food",
      "farmers",
      "meat",
      "farming",
      "and",
      "soil",
      "the",
      "to",
      "agriculture",
      "of"
    ],
    "Representative_Docs": [
      "Governments must support farmers to produce food that is good for people, animals and nature. If not, the true cost of unsustainable food - to our environment, and our future, will be much higher. www.slowfood.comblog-and-new...",
      "\"The report recommended that if global red meat eating was cut by 50%, the planetary health diet would provide nutritious food to all while tackling the harms caused by animal agriculture, which accounts for over 14% of all greenhouse gas emissions worldwide\" Seems like an easy solution",
      "Curious what your thinking is. Particularly with climate change, but also with the disruption of food supplies caused by war, would it not be better for the UK to have to rely less on other countries to supply us with food?"
    ]
  },
  {
    "Topic": 13,
    "Count": 1715,
    "Name": "13_tariffs_china_us_the",
    "Representation": [
      "tariffs",
      "china",
      "us",
      "the",
      "to",
      "tariff",
      "trade",
      "and",
      "manufacturing",
      "rare"
    ],
    "Representative_Docs": [
      "Trump and GOP will make America 10-20 years behind China in the EV war. They know the horrible pollution they have isn't a good look. If they get ahead of us they will be able to show cleaner air in 5 years. All we can hope for now is their solutions will be the standard \"made in China\" quality.",
      "The tariffs will make sure of that. Good for the environment.",
      "Tariffs Can't Stop China's Clean Energy From Winning the Future -Foreign Policy Tariff TradeWar CleanEnergy More info from EcoSearch"
    ]
  },
  {
    "Topic": 14,
    "Count": 1682,
    "Name": "14_trees_forests_forest_logging",
    "Representation": [
      "trees",
      "forests",
      "forest",
      "logging",
      "tree",
      "national",
      "our",
      "to",
      "the",
      "of"
    ],
    "Representative_Docs": [
      "I never said Trumps act is right. I just responded to all post like OMG they allow logging old trees. I understand people can be emotional on that matter, but the fact is that mature forests are carbon neutral. Turning them into carbon storage by selectively logging old trees and use that timber",
      "This is the let’s cut down half the trees in our national forests’ thing, right?",
      "Logging in National Forests? The U.S. has announced sweeping changes to encourage more logging in the country's national forests. A new emergency order requires rolling back environmental protections on almost 60% of the national forests, more than 112 million acres of land, mostly in the West."
    ]
  },
  {
    "Topic": 15,
    "Count": 1513,
    "Name": "15_heat_pump_pumps_heating",
    "Representation": [
      "heat",
      "pump",
      "pumps",
      "heating",
      "it",
      "to",
      "the",
      "in",
      "for",
      "have"
    ],
    "Representative_Docs": [
      "With no heat pump, it must rely on resistance. That sounds expensive around here where gas energy is 16 the price of electricity. Maybe 14 with variable electric pricing. In combination with a heat pump, it would be excellent for bridging extreme cold snaps when heat pumps don't function well.",
      "I have heat pump, it’s true. I also have water radiator with gas boiler. I use that mostly for winter because it thrives on cold draft to covert it to heat. My heat pump struggled to keep up, costing me too much money",
      "I love my heat pumps. You’ll love your heat pumps. We can be heat pump evangelist together."
    ]
  },
  {
    "Topic": 16,
    "Count": 1504,
    "Name": "16_water_datacentres_driest_sewage",
    "Representation": [
      "water",
      "datacentres",
      "driest",
      "sewage",
      "techs",
      "areas",
      "companies",
      "the",
      "worlds",
      "of"
    ],
    "Representative_Docs": [
      "Revealed Big tech’s new datacentres will take water from the world’s driest areas Amazon, Google and Microsoft are building datacentres in water-scarce parts of five continents",
      "Revealed Big tech’s new datacentres will take water from the world’s driest areas Amazon, Google and Microsoft are building datacentres in water-scarce parts of five continents Amazon, Microsoft and Google are operating datacentres that use vast amounts of water in some of the world’s d...",
      "\"In 2023 Microsoft said that 42% of its water came from areas with water stress, while Google said 15% of its water consumption was in areas with high water scarcity. Watch how new datacentres will exacerbate water scarcities vulnerabilities in areas where water is already limited scarce"
    ]
  },
  {
    "Topic": 17,
    "Count": 1393,
    "Name": "17_ice_march_europe_warming",
    "Representation": [
      "ice",
      "march",
      "europe",
      "warming",
      "sea",
      "record",
      "the",
      "global",
      "2024",
      "in"
    ],
    "Representative_Docs": [
      "Copernicus Warmest March in Europe, lowest Arctic winter sea ice March 2025 was the second warmest March globally, with an average ERA5 surface air temperature of 14.06°C, 0.65°C above the 1991-2020 average and 1.60°C above the pre-industrial level for March. climate.copernicus.eucopernicus-w...",
      "Europe has just had its hottest March on record. The record is is part of a trend of extraordinary global heat. It was also the second-warmest March globally, behind March 2024. On average, global temperatures in March were 1.6C higher than pre-industrial levels.",
      "Last year was the hottest year on record for Europe, with record-high annual temperatures in almost half of the continent. The latest European State of the Climate report from the EU’s Copernicus service C3S shows that 45% of days were much warmer than average, and 12% were the warmest on record"
    ]
  },
  {
    "Topic": 18,
    "Count": 1243,
    "Name": "18_wind_offshore_windmills_turbines",
    "Representation": [
      "wind",
      "offshore",
      "windmills",
      "turbines",
      "power",
      "energy",
      "the",
      "turbine",
      "project",
      "farm"
    ],
    "Representative_Docs": [
      "Trump administration issues order to stop construction on New York offshore wind project. ClimateCrisis apnews.comarticlewind...",
      "US Offshore Wind Projects Slow httpswww.europesays.com1973700 Energy firms have slowed construction of offshore wind farms in the U.S. for various reasons in recent years,",
      "Wind has a similar issue. Like right now where I am, there's no wind. They'd be producing no power at the moment. And at times where power is being produced but not being used, it'd need storage. Wind and solar have nearly the same problem. But wind has another hidden problem killing birds."
    ]
  },
  {
    "Topic": 19,
    "Count": 1180,
    "Name": "19_earth_day_april_join",
    "Representation": [
      "earth",
      "day",
      "april",
      "join",
      "event",
      "at",
      "celebrate",
      "our",
      "for",
      "earthday"
    ],
    "Representative_Docs": [
      "Join us Saturday April 19th to celebrate Earth Day with BHO's Climb for Climate event! From 10am-4pm climb to the Observatory to tell us what \"Earth Day Means to You\". Then, explore the Observatory at our \"open house\"! For more info, visit bluehill.org and go to \"Events and Webinars\". See you there!",
      "The theme for Earth Day 2025 on Tuesday 22 April is Our Power, Our Planet, which invites everyone around the world to unite behind renewable energy. There are many ways you can get involved and make a difference for our planet on Earth Day and every day bit.ly4jxbmZ7",
      "Celebrate Earth Day with your community! This year’s Earth Day Festival will be held on Sunday, April 27 at Durham Central Park. Find out how you and your family can help drive positive change for our environment on Bull City Today."
    ]
  },
  {
    "Topic": 20,
    "Count": 1159,
    "Name": "20_prices_gas_oil_price",
    "Representation": [
      "prices",
      "gas",
      "oil",
      "price",
      "down",
      "are",
      "crude",
      "in",
      "the",
      "up"
    ],
    "Representative_Docs": [
      "This is a lie. Gas prices and food prices are not down and I could see it every day at the gas station and in the store.",
      "Letter to the editor Oil prices vs. gas prices httpstriblive.comopinionletter-to-the-editor-oil-prices-vs-gas-prices",
      "Gas prices drive energy prices gas power and the price cap is set on past prices so you can look at spot prices recently and see that the drop off in gas prices due to Trump is going to lead to this effect falling off in 3-6 months time"
    ]
  },
  {
    "Topic": 21,
    "Count": 1111,
    "Name": "21_air_pollution_paris_quality",
    "Representation": [
      "air",
      "pollution",
      "paris",
      "quality",
      "clean",
      "in",
      "and",
      "the",
      "to",
      "health"
    ],
    "Representative_Docs": [
      "Paris said au revoir to cars. Air pollution maps reveal a dramatic change.",
      "Paris said au revoir to cars. Air pollution maps reveal a dramatic change. Air pollution fell substantially as the city restricted car traffic and made way for parks and bike lanes. Wash Post 4132025",
      "I should have included headline and subhead Paris said au revoir to cars. Air pollution maps reveal a dramatic change. Air pollution fell substantially as the city restricted car traffic and made way for parks and bike lanes."
    ]
  },
  {
    "Topic": 22,
    "Count": 1103,
    "Name": "22_wood_wildfire_wildfires_fires",
    "Representation": [
      "wood",
      "wildfire",
      "wildfires",
      "fires",
      "burning",
      "fire",
      "stove",
      "smoke",
      "in",
      "the"
    ],
    "Representative_Docs": [
      "You will never be able to reach the same levels of pollution as a gas boiler with wood burning using filtration. We need to transition to renewables as soon as possible. In the meantime choose gas rather than wood burning.",
      "Moving won't help. Even if you moved to an area that had no wood burning stoves, there's nothing stopping your neighbours from installing one. We need to phase out wood burning, with help from the government.",
      "wildfire wildfires climate climatechange climatecrisis climateemergency"
    ]
  },
  {
    "Topic": 23,
    "Count": 1045,
    "Name": "23_species_biodiversity_ocean_coral",
    "Representation": [
      "species",
      "biodiversity",
      "ocean",
      "coral",
      "endangered",
      "wolves",
      "the",
      "deextinction",
      "dire",
      "to"
    ],
    "Representative_Docs": [
      "In what could be one of the most significant actions the Trump admin has taken on the environment, officials have proposed redefining what it means to harm a plant or animal under the Endangered Species Act, excluding habitat destruction from activities deemed a threat to protected species.",
      "Falsely calling genetically modified grey wolves to be a resurrected extinct species is a good example of how poor, willful or not, media framing can cause significant harm. httpswww.washingtonpost.comclimate-environment20250410trump-endangered-species-protections-dire-wolves",
      "Commentary De-extinct’ dire wolves hide humanity’s destruction of nature Biodiversity Biodiversity Crisis httpswww.channelnewsasia.comcommentarydire-wolf-extinct-conservation-nature-biodiversity-crisis-5066801"
    ]
  },
  {
    "Topic": 24,
    "Count": 971,
    "Name": "24_housing_planning_concrete_homes",
    "Representation": [
      "housing",
      "planning",
      "concrete",
      "homes",
      "the",
      "to",
      "and",
      "of",
      "green",
      "is"
    ],
    "Representative_Docs": [
      "It's good to build housing where people want to live. Close to jobs and infrastructure. This allows us to give people a good quality of life without building on green areas outside of cities",
      "It is not possible to address climate given the sprawl of the US without some combination of EVs and density. Housing needs will also increase due to climate related migration and housing destroyed by climate itself. If you want lots of social housing you should want something like an..",
      "Geez, that wasn’t very GREEN was it! Wasn’t that housing development supposed to provide smaller more sustainable housing surrounded by green space - not gas powered houses with concrete yards no trees!"
    ]
  },
  {
    "Topic": 25,
    "Count": 944,
    "Name": "25_hydrogen_green_h2_fuel",
    "Representation": [
      "hydrogen",
      "green",
      "h2",
      "fuel",
      "of",
      "the",
      "is",
      "to",
      "for",
      "in"
    ],
    "Representative_Docs": [
      "Having worked for 20 years at a company that used byproduct hydrogen to produce steam, I can give you some facts 1- hydrogen has 13 the heat capacity as natural gas. 2- Hydrogen does not produce any greenhouse gases.",
      "This argument makes no sense sadly. Hydrogen is very expensive. Do you know how much hydrogen stations cost to implement? Your numbers do not add up. I have not seen any major move towards hydrogen heavy transport.",
      "White hydrogen expected to have much lower production costs and carbon emissions than man-made hydrogen"
    ]
  },
  {
    "Topic": 26,
    "Count": 759,
    "Name": "26_autism_rfk_environmental_jr",
    "Representation": [
      "autism",
      "rfk",
      "environmental",
      "jr",
      "factors",
      "he",
      "toxins",
      "kennedy",
      "cause",
      "is"
    ],
    "Representative_Docs": [
      "RFK Jr. to refocus federal autism research on environmental factors tennesseelookout.com20250417r...",
      "RFK Jr. to refocus federal autism research on environmental factors michiganadvance.com20250416r...",
      "He said in this video that autism is an environmental disease that is preventable. This is 100% false. Autism is not preventable, it is genetic and not caused by the environment. Many kids with autism grow up and lead perfectly productive and normal lives just like all of us do. RFK Jr is a danger"
    ]
  },
  {
    "Topic": 27,
    "Count": 729,
    "Name": "27_steel_furnaces_british_scunthorpe",
    "Representation": [
      "steel",
      "furnaces",
      "british",
      "scunthorpe",
      "uk",
      "blast",
      "the",
      "nationalise",
      "iron",
      "to"
    ],
    "Representative_Docs": [
      "Steel is the backbone of Britain's industryand British steel is central to the Green Industrial Revolution we need. Today I backed the Steel Industry Special Measures Bill and made the case for public ownership, more recycling of scrap steel, fair electricity prices, and support for innovation.",
      "This is about steel and oil. We need steel and we need no fossil fuels. It's not rocket science.",
      "Private ownership is a barrier to green steel in the UK. Events show this to be true as the government seeks powers to control British Steel. Public ownership would be better, this extended to Tata steel. A public steel company is the sure way for green steel to be made in the UK."
    ]
  },
  {
    "Topic": 28,
    "Count": 652,
    "Name": "28_zero_net_netzero_the",
    "Representation": [
      "zero",
      "net",
      "netzero",
      "the",
      "to",
      "is",
      "uk",
      "and",
      "decarbonization",
      "of"
    ],
    "Representative_Docs": [
      "It’s time to take a more global view of the existential threat Trump and Musk pose - and the solutions. Trump has reneged on net zero, ripping off the world Musk is Mars first, working to kill net zero by installing Reform UK, AfD, Canadian Conservatives, etc.",
      "Key Stage 3 took part in the 'Net Zero What's it got to do with you?' workshop, they reviewed the 2050 Net Zero targets, researched retrofit measures to make homes more energy efficient and analysed which renewable technologies they could use to build their own Net Zero town. 24",
      "So many flaws in this piece. Here's four 1. Net zero cutting 100% of carbon emissions. Basic stuff. 2. Aim of net zero law was not to make steelmaking more expensive 3. No evidence as to why \"net zero in one country policies are simplistic\" 4. This is a U-turn, apparently, but we're not told how"
    ]
  },
  {
    "Topic": 29,
    "Count": 591,
    "Name": "29_fashion_clothes_clothing_wear",
    "Representation": [
      "fashion",
      "clothes",
      "clothing",
      "wear",
      "my",
      "and",
      "for",
      "the",
      "to",
      "of"
    ],
    "Representative_Docs": [
      "\"We must also be mindful of our fashion choices and the constant pressure to buy new clothing to keep up with trends. The fashion industry is a major contributor to global warming, accounting for 8-10% of global carbon emissions, more than the combined...\" gracek.substack.comptaking-per...",
      "End 'fast fashion' Fast fashion is fueling a waste crisis, and it’s time we take action. Every year, millions of tons of clothing end up in landfills, polluting our environment and contributing to climate change. patimes.medianet-newslet...",
      "Be green and sustainable for the environment. No fast fashion!"
    ]
  },
  {
    "Topic": 30,
    "Count": 577,
    "Name": "30_she_her_shes_to",
    "Representation": [
      "she",
      "her",
      "shes",
      "to",
      "the",
      "and",
      "was",
      "is",
      "that",
      "of"
    ],
    "Representative_Docs": [
      "Yes. Her dad broke up with gf of 7 years because she said it was her or his daughter. Ridiculous. We found out how bad the gf has been treating her. So she’s losing what she considers a step sister with that. But at her mom’s house much better environment and she’s about to have a baby sister.",
      "I hate her so much. What she's doing is not what she said she'd do and it's going to do more than harm gas prices.",
      "You seem to don’t seem to comprehend service for your country. She is doing what ever she can to save the environment, and bless her for it. It must be awful and gross for her to do it. But she is putting her constituents and the environment first."
    ]
  },
  {
    "Topic": 31,
    "Count": 486,
    "Name": "31_pressure_water_shower_flow",
    "Representation": [
      "pressure",
      "water",
      "shower",
      "flow",
      "showers",
      "showerheads",
      "he",
      "order",
      "executive",
      "heads"
    ],
    "Representative_Docs": [
      "I'm for water pressure freedom. Keep government out of my water pressure setting.",
      "He has zero understanding or caring about the whyswherefores of water conservation. And he mistakenly has said it's a problem with water pressure. No, low-flow shower heads can still deal with plenty of water pressure.",
      "Trump doesn’t just spend his days golfing. He signed a new executive order this week against the left’s war on water pressure, by rolling back rules requiring water-saving devices like low-flow showerheads. He explained In my case I like to take a nice shower, to take care of my beautiful hair."
    ]
  },
  {
    "Topic": 32,
    "Count": 455,
    "Name": "32_doge_dogs_dog_pet",
    "Representation": [
      "doge",
      "dogs",
      "dog",
      "pet",
      "cats",
      "pets",
      "cat",
      "and",
      "environmental",
      "the"
    ],
    "Representative_Docs": [
      "Pet dogs have extensive and multifarious’ impact on environment, new research finds Dogs httpswww.europesays.com1980917 Dogs have extensive and multifarious environmental impacts, disturbing wildlife, polluting waterways and contributing to carbon emissions, new research",
      "Pet dogs have extensive and multifarious’ impact on environment, new research finds.’ Clearly like cats the research finds it’s the owners, not the dogs.",
      "Pet dogs have extensive and multifarious’ impact on environment, new research finds Dogs httpswww.europesays.com1980917 Dogs have extensive and multifarious environmental impacts, disturbing wildlife, polluting waterways and contributing to carbon emissions, new research"
    ]
  },
  {
    "Topic": 33,
    "Count": 410,
    "Name": "33_musk_elon_tesla_he",
    "Representation": [
      "musk",
      "elon",
      "tesla",
      "he",
      "his",
      "musks",
      "to",
      "and",
      "is",
      "the"
    ],
    "Representative_Docs": [
      "Tesla, Musk politics Where do we draw the line? The backlash against Elon Musk is understandable, but does targeting Tesla risk undermining the EV movement? With Trump Musk aligning on climate rollbacks, it's time to be strategic, not reactionary. ClimateAction EVs Tesla",
      "Elon Musk Unveils New Clean Energy Luxury Car Pulled By 8 Tesla Employees theonion.comelon-musk-un...",
      "Elon Musk is a MORON. I don't care what anyone thinks. Look at that tweet below. Musk predicted Covid was going to end in a matter of weeks. Musk moved an EV company from one of the greenest areas on Earth to the middle of OIL COUNTRY. Musk partnered up with TRUMP. I mean, come on!"
    ]
  },
  {
    "Topic": 34,
    "Count": 290,
    "Name": "34_pipeline_pipelines_keystone_oil",
    "Representation": [
      "pipeline",
      "pipelines",
      "keystone",
      "oil",
      "spill",
      "dakota",
      "greenpeace",
      "wwwcommondreamsorgnewskeyston",
      "the",
      "latest"
    ],
    "Representative_Docs": [
      "Same works PIPELINE RHETORIC. CONTROLED LEAK - environmental clean up. Keystone. I thought that was done over or is this a sector of built before the ban ? apnews.comarticlekeys... Keystone Pipeline restarted after oil spill in rural North Dakota",
      "Keystone oil pipeline leaks again in North Dakota, adding to long list of failures -The Daily Climate Pipeline More info from EcoSearch",
      "Greenpeace Says Latest Keystone Pipeline Spill Shows Why Big Oil Targets Climate Activists httpswww.europesays.com1988987 Greenpeace Says Latest Keystone Pipeline Spill Shows Why Big Oil Targets Climate Activists httpswww.commondreams.orgnewskeystone-pipeline-oil-spill by"
    ]
  },
  {
    "Topic": 35,
    "Count": 287,
    "Name": "35_lead_water_fluoridation_fluoride",
    "Representation": [
      "lead",
      "water",
      "fluoridation",
      "fluoride",
      "leaded",
      "fluoridated",
      "in",
      "paint",
      "pipes",
      "to"
    ],
    "Representative_Docs": [
      "It’s the lead right? The exposure to environmental lead in paint, fuel etc. Please tell me it’s not just a natural part of aging.",
      "Lead is the most dangerous things affecting America today. Lead in its water supply, lead in old paint, lead that's being fired from guns and now lead in baby food. kidshealth.orgenparentsl...",
      "Lead paint has been banned in the US for a long time. Lead poisoning can come from flaking of old lead paint, lead in soil from leaded gasoline, which Europe took longer to ban actually, industrial pollution, lead pipes."
    ]
  },
  {
    "Topic": 36,
    "Count": 280,
    "Name": "36_texas_wind_solar_bill",
    "Representation": [
      "texas",
      "wind",
      "solar",
      "bill",
      "energy",
      "tx",
      "power",
      "ercot",
      "senate",
      "in"
    ],
    "Representative_Docs": [
      "Texas \"We're going to need more power!\" Also Texas Renewable energy companies face little regulation in Texas. A state lawmaker wants to change that. www.texastribune.org20250408r... via texastribune.org",
      "These idiots in the Texas Senate. It should be noted that Texas is the LARGEST in the Utility Scale Solar Market of 50 Billion. This bill was to slow it down but this not only will kill it but it will raise Electric Bills in Texas. Hope the House rejects it. pv-magazine-usa.com20250416t...",
      "28% of Texas energy comes from renewable. Even Texas knows there's no such thing as clean coal."
    ]
  },
  {
    "Topic": 37,
    "Count": 276,
    "Name": "37_women_trans_men_gender",
    "Representation": [
      "women",
      "trans",
      "men",
      "gender",
      "climate",
      "people",
      "the",
      "to",
      "woman",
      "are"
    ],
    "Representative_Docs": [
      "Instead of being a voice for women’s rights or our climate crisis these women do damage to both causes . What were they thinking?",
      "You should talk to some women, some trans people and some women officers and work it out. The thing that completely invalidates this judgement is that evidence from the trans folk was excluded. You have to work together, not easy in this climate.",
      "it’s like bad to do in this climate kind of, but genuinely if you hit a trans misogynist you will also be hitting a misogynist. if they hate trans women they also hate cis women"
    ]
  },
  {
    "Topic": 38,
    "Count": 273,
    "Name": "38_story_league_reproductive_independent",
    "Representation": [
      "story",
      "league",
      "reproductive",
      "independent",
      "developing",
      "the",
      "teams",
      "ground",
      "helps",
      "whether"
    ],
    "Representative_Docs": [
      "Eddie Howe taken to hospital ahead of Newcastle’s clash with Manchester United httpswww.eucup.com985649 Your support helps us to tell the story From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it’s investigating",
      "How Liverpool could win the Premier League title this weekend httpswww.eucup.com995410 Your support helps us to tell the story From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it’s investigating the financials of",
      "Manchester United The Independent httpswww.eucup.com990100 Your support helps us to tell the story From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it’s investigating the financials of Elon Musk’s pro-Trump PAC"
    ]
  },
  {
    "Topic": 39,
    "Count": 271,
    "Name": "39_apple_phone_iphone_iphones",
    "Representation": [
      "apple",
      "phone",
      "iphone",
      "iphones",
      "it",
      "to",
      "phones",
      "the",
      "nintendo",
      "switch"
    ],
    "Representative_Docs": [
      "Apple says it has cut its carbon footprint by 60% since 2015. Apple NetZero www.csofutures.comnewsapple-s...",
      "Apple continues to make progress on its previously announced Apple 2030 goal, hoping to become carbon neutral over the next five years.",
      "Apple is one of the biggest polluters on the planet. Packaging alone disgusting. I would never buy another one again and I used to be nothing but Apple"
    ]
  },
  {
    "Topic": 40,
    "Count": 249,
    "Name": "40_insurance_companies_insurers_climate",
    "Representation": [
      "insurance",
      "companies",
      "insurers",
      "climate",
      "change",
      "premiums",
      "home",
      "risk",
      "are",
      "risks"
    ],
    "Representative_Docs": [
      "High insurance risk areas. Just ask insurance companies about the reality of climate change right now and its impacts to inflation around the world - dontlookup at the arctic",
      "How do we solve the climate change home insurance crisis? The Public's Radio EnvironmentalNews ClimateChange Insurance",
      "James M Cain summed up insurance as us betting insurance companies that something terrible is going to happen, and the insurance companies betting it won't. The problem with climatechange is that we are right and insurance companies are taking a pounding www.nature.comarticless44..."
    ]
  },
  {
    "Topic": 41,
    "Count": 239,
    "Name": "41_protest_protests_climate_protesters",
    "Representation": [
      "protest",
      "protests",
      "climate",
      "protesters",
      "peaceful",
      "police",
      "activists",
      "protesting",
      "the",
      "to"
    ],
    "Representative_Docs": [
      "US intensifies crackdown on peaceful protest under Trump Climate Crisis Criminal law Protest Protests Trump war httpswww.theguardian.comus-news2025apr09anti-protest-bills-trump",
      "What do climate protests actually achieve? More than you think. The evidence is in Protests can persuade people, and maybe even change how they vote. grist.orgprotestclim... Protest Climate Environment Trump Greensky",
      "What do climate protests actually achieve? More than you think. The evidence is in Protests can persuade people, and maybe even change how they vote. grist.orgprotestclim... Protest Climate GreenSky Environment Trump"
    ]
  },
  {
    "Topic": 42,
    "Count": 237,
    "Name": "42_life_planet_atmosphere_k218b",
    "Representation": [
      "life",
      "planet",
      "atmosphere",
      "k218b",
      "dms",
      "dimethyl",
      "gases",
      "detected",
      "of",
      "gasses"
    ],
    "Representative_Docs": [
      "Such an impressive and exciting discovery. We're talking about a planet 700 TRILLION miles away. \"The amount we estimate of this gas in the atmosphere is thousands of times higher than what we have on Earth. So, if the association with life is real, this planet will be teeming with life.\"",
      "Scientists say they’ve found the strongest hint yet of life beyond our solar systemspotting gases in a distant planet’s atmosphere that, here on Earth, are only produced by living organisms. news.sky.comstorystrong...",
      "Scientists have found what they are calling the strongest sign yet of possible life beyond our solar system after detecting the chemical footprint of gases in an alien planet's atmosphere that on Earth are only produced by living organisms. ."
    ]
  },
  {
    "Topic": 43,
    "Count": 224,
    "Name": "43_fascism_fascist_fascists_climate",
    "Representation": [
      "fascism",
      "fascist",
      "fascists",
      "climate",
      "the",
      "is",
      "and",
      "of",
      "are",
      "to"
    ],
    "Representative_Docs": [
      "tell your friends and family. we absolutely cannot afford to have a conservative government in this social climate. the ultimate goal of conservatism is fascism, and open fascism is on the rise globally",
      "Wait till you learn about the connections between global warming and rising fascism. Thinking you can only focus on one means you're going to let your children die from global warming and fascism.",
      "Fascism is like climate change where you see it in videos and see people talking about it in comments and then you are the one experiencing it. Fascism is coming for everyone and it’s accelerating wry very fast."
    ]
  },
  {
    "Topic": 44,
    "Count": 222,
    "Name": "44_princeton_funding_research_climate",
    "Representation": [
      "princeton",
      "funding",
      "research",
      "climate",
      "anxiety",
      "universities",
      "trump",
      "administration",
      "university",
      "4m"
    ],
    "Representative_Docs": [
      "Trump administration cuts 4m to Princeton’s climate research funding Climate",
      "Breaking Trump administration cuts 4m to Princeton’s climate research funding White House claims university’s work exposed students to climate anxiety’ and exaggerated... Via The Guardian Princeton Funding Climate What's your take on this?",
      "The Trump administration announced it is cutting nearly 4 million in federal funding for climate change research at Princeton University, saying that the work promoted exaggerated and implausible climate threats and increased climate anxiety among young Americans."
    ]
  },
  {
    "Topic": 45,
    "Count": 215,
    "Name": "45_geothermal_energy_taiwan_in",
    "Representation": [
      "geothermal",
      "energy",
      "taiwan",
      "in",
      "iceland",
      "google",
      "fervo",
      "power",
      "to",
      "first"
    ],
    "Representative_Docs": [
      "Google’s geothermal energy ambitions are growing httpswww.theverge.comnews648979google-geothermal-energy-power-purchase-agreement-asia-taiwan The company signed the first deal of its kind to develop geothermal energy projects in Taiwan",
      "Today, Google announced the first corporate geothermal energy deal in Taiwan. These first projects will add 10 MW of geothermal energy to the grid - nearly doubling its current installed geothermal capacity - and help catalyze the geothermal market across APAC. More blog.googlearound-the-g...",
      "Next-generation geothermal has the potential to meet up to 15% of global electricity demand growth through 2050. But transitioning from commercial geothermal to next-generation geothermal has its challenges."
    ]
  },
  {
    "Topic": 46,
    "Count": 208,
    "Name": "46_sustainability_award_awards_2025",
    "Representation": [
      "sustainability",
      "award",
      "awards",
      "2025",
      "business",
      "sustainable",
      "winners",
      "for",
      "our",
      "the"
    ],
    "Representative_Docs": [
      "\"\" lnkd.indzMfTjiM Stay connected to the most current regional business priorities centered around sustainability. Explore the top daily headlines for timely and pertinent insights. Sustainability ClimateAction renewables",
      "\"\" lnkd.indAJ7QeW3 Stay connected to the most current regional business priorities centered around sustainability. Explore the top daily headlines for timely and pertinent insights. Sustainability ClimateAction renewables",
      "Sustainability award winners announced! - UM Today News -University of Manitoba Sustainability More info from EcoSearch"
    ]
  },
  {
    "Topic": 47,
    "Count": 204,
    "Name": "47_light_cards_pollution_green",
    "Representation": [
      "light",
      "cards",
      "pollution",
      "green",
      "lighting",
      "you",
      "my",
      "the",
      "have",
      "to"
    ],
    "Representative_Docs": [
      "Light pollution makes me sad. At the very least, we should have a time of night where every artificial light must be turned off or very, very dimmed. Just an hour, late at night would be fine. Anything. I just want to see the beauty of the natural sky for once.",
      "Light pollution is bad for nature, including people. I this so much!",
      "I just want NVG’s so I can go somewhere with little to no light pollution at night and look up."
    ]
  },
  {
    "Topic": 48,
    "Count": 200,
    "Name": "48_maga_magas_the_muddling",
    "Representation": [
      "maga",
      "magas",
      "the",
      "muddling",
      "biggest",
      "greatness",
      "climate",
      "and",
      "is",
      "mistake"
    ],
    "Representative_Docs": [
      "Not least, because we now see MAGA means Muddling America’s Greatness Away. Trump's biggest strategic mistake - and biggest crime against humanity is to steal the world’s Climate Budget by pulling out of the Paris Agreement, isolating the US in a minority of one. It will bite him in the ass.",
      "If someone who was MAGA realized the error of their ways and changed for the better, and you decide to actively not accept them, making the environment hostile for them, causing them to retreat back to MAGA, imo, you are just as bad as MAGA.",
      "Ponderings 41925 2 -Why does MAGA deny climate change? -Why does MAGA deny benefits of vaccines? -Living in a MAGA district we see the dismissal of science daily -What gives them the knowledge to refute science? -Why does MAGA fear science? When it's benefited them so much -They can'twon't say"
    ]
  }
]