[
  {
    "Topic": -1,
    "Count": 95358,
    "Name": "-1_the_and_to_of",
    "Representation": [
      "the",
      "and",
      "to",
      "of",
      "in",
      "climate",
      "for",
      "is",
      "on",
      "that"
    ],
    "Representative_Docs": [
      "I also think we need to embrace law in a more civil rights reform era way, it needs modernizing and buy in from the currently living people and the next generation not just traditions. I don’t care what people 200 years ago would do on climate change as much I care about preserving life on earth.",
      "If you would like to know, for example, how any of the parties plans to address global warming, you can't, because none of them has published any information or at least none that I can easily find about what their climate policies would be.",
      "It will be a long time for that to return if ever. The world saw the great flaw of our government. Every four years there will always be a threat of sea change to threaten the world economy. That will always be in the back of their minds, for at least a generation."
    ]
  },
  {
    "Topic": 0,
    "Count": 4912,
    "Name": "0_coal_clean_trump_plants",
    "Representation": [
      "coal",
      "clean",
      "trump",
      "plants",
      "beautiful",
      "miners",
      "mining",
      "power",
      "executive",
      "orders"
    ],
    "Representative_Docs": [
      "\"Beautiful clean coal\" sure, that's why so many coal miners got black lung disease.",
      "Coal that has been there , just being there , a different kind of coal, actually nobody has ever seen coal like this before.",
      "Studies show that burning coal is bad for the environment. But that doesn’t apply to beautiful clean coal. That’s the kind of coal that is good for you."
    ]
  },
  {
    "Topic": 1,
    "Count": 3662,
    "Name": "1_ai_data_use_centers",
    "Representation": [
      "ai",
      "data",
      "use",
      "centers",
      "energy",
      "chatgpt",
      "it",
      "artists",
      "and",
      "of"
    ],
    "Representative_Docs": [
      "We can, and should, do all those things without AI - I would feel extremely uncomfortable using AI to provide feedback for any student work. If I don’t want students to submit work produced with AI, how can I use it to give them feedback? Also AI data centres reverse decades of climate action.",
      "Data Centers Will Use Twice as Much Energy by 2030-Driven by AI -Scientific American AI Data More info from EcoSearch",
      "AI Energy Rise of AI Energy demand for AI AI for energy optimization. AI for energy innovation. Future interdependence between AI, energy, technology, security, policy, and more. IEA www.iea.orgnewsai-is-s..."
    ]
  },
  {
    "Topic": 2,
    "Count": 3358,
    "Name": "2_auspol_dutton_australia_lnp",
    "Representation": [
      "auspol",
      "dutton",
      "australia",
      "lnp",
      "nuclear",
      "australian",
      "peter",
      "gas",
      "duttons",
      "coalition"
    ],
    "Representative_Docs": [
      "Ted O’Brien just said it at the presser. Our plan is to get more gas for export. What about the CO2 emissions with all this extra gas. Why hasn’t Dutton mentioned the words Climate change since the election was called. auspol climatechange",
      "Peter Dutton being asked not a very difficult question about whether he agreed with the science on climate change. Effectively, he said he’s not a scientist and couldn’t say ' auspol",
      "Peter Dutton makes international news - and not in a good way. Climate change deniers are alive and well in the Coalition. Dutton has already promised to wind back the Albanese govt's advances in renewables. Don't risk Dutton auspol www.europesays.com2002617"
    ]
  },
  {
    "Topic": 3,
    "Count": 2659,
    "Name": "3_carbon_co2_capture_emissions",
    "Representation": [
      "carbon",
      "co2",
      "capture",
      "emissions",
      "ppm",
      "co",
      "atmosphere",
      "is",
      "the",
      "of"
    ],
    "Representative_Docs": [
      "Weirdly... one thing we can do to increase carbon storage is to bury plastics and make plant-based true plastics. when we make plastics from carbon in the atmosphere not extracting extra carbon from storage we actually reduce atmospheric carbon. its not CURRENTLY efficient",
      "Total investment in the new mill is estimated at 4.5 billion USD4.9 billion, and the project is expected to reduce Sweden’s CO2 emissions by 7%. That’s right. One project can reduce a whole country’s co2 emissions by 7%.",
      "Yet. Despite all the \"look at how much renewables we added,\" the ONLY thing that matters is how much we, collectively, reduce CO2 emissions. But guess what. Globally, carbon emissions are still going up."
    ]
  },
  {
    "Topic": 4,
    "Count": 1996,
    "Name": "4_plastic_plastics_waste_microplastics",
    "Representation": [
      "plastic",
      "plastics",
      "waste",
      "microplastics",
      "recycling",
      "packaging",
      "bags",
      "recycled",
      "compost",
      "pollution"
    ],
    "Representative_Docs": [
      "This account was started to help us all use less plastic. Why? Because microplastics are now in our brains. Because the oceans are drowning in ever more synthetic waste. Because we can’t keep treating plastic like it’s disposable when it’s anything but.",
      "Global Plastic Recycling Rate 'Stagnant' at 9% Study -EcoWatch Plastic Recycling More info from EcoSearch",
      "Every piece of plastic ever produced still exists in our environment and bodies. The more we produce, the more plastics will pile up. We can protect future generations and ourselves from accumulating even more plastic by swiftly starting to reduce, and eventually end, plastic production."
    ]
  },
  {
    "Topic": 5,
    "Count": 1996,
    "Name": "5_food_meat_farmers_farming",
    "Representation": [
      "food",
      "meat",
      "farmers",
      "farming",
      "soil",
      "agriculture",
      "animal",
      "vegan",
      "plantbased",
      "beef"
    ],
    "Representative_Docs": [
      "We have to move away from intensive feed crop farming for the meat and dairy industry, and towards many more legumes that fix nitrogen in soil. Food forests and eating more foraged native foods from rewilded land would be good too but likely not commercially viable on large scales",
      "what is the primary driver according to your source? global food systems. agriculture, comes with habitat destruction, water extraction, pesticides. the more people there are, the more agriculture there will be. this is about our life support systems, all being vegan would help, but not more of us",
      "Big meat and dairy are using the fossil fuel anti-climate handbook. Landmark Eat Lancet Commission study which showed reducing red meat would provide nutritious food for all while tackling harms from animal agriculture -attacked in media by PR firm hired by big meat interest"
    ]
  },
  {
    "Topic": 6,
    "Count": 1922,
    "Name": "6_forests_trees_forest_logging",
    "Representation": [
      "forests",
      "trees",
      "forest",
      "logging",
      "tree",
      "national",
      "our",
      "timber",
      "planting",
      "to"
    ],
    "Representative_Docs": [
      "Half of our National Forests are now open to logging as Trump has removed environmental protections.",
      "Trump wants to cut down all trees in our beautiful forest! He’s opening our forest to logging! Just think what that means for our climate and our environment!!! We need to stop him from doing this!!!",
      "Under Trump's executive order USDA to cut 25% more trees from our National Forests Clear cutting is not good for forests We need the carbon Which of Trump's Oligarchs profits off this? These forests are our legacy to our children and grandchildren lailluminator.com20250307t..."
    ]
  },
  {
    "Topic": 7,
    "Count": 1904,
    "Name": "7_space_ozone_rocket_katy",
    "Representation": [
      "space",
      "ozone",
      "rocket",
      "katy",
      "flight",
      "perry",
      "tourism",
      "layer",
      "bezos",
      "origin"
    ],
    "Representative_Docs": [
      "if blue origin are intending to send waste and pollution into space why did they let katy perry come back",
      "\"What Blue Origin wants to do is take the waste here and figure out a way to put it in space to make our planet cleaner.\" Jettisoning junk into space to add to existing space debris - which is already out of control - is supposed to be a good thing?",
      "Hate on Katy Perry all you like, talk about environmental impact all you want, but I bet if you had the chance to go into space, you'd do it"
    ]
  },
  {
    "Topic": 8,
    "Count": 1797,
    "Name": "8_noaa_weather_research_funding",
    "Representation": [
      "noaa",
      "weather",
      "research",
      "funding",
      "climate",
      "budget",
      "nasa",
      "data",
      "administration",
      "cuts"
    ],
    "Representative_Docs": [
      "White House Budget Would Slash Funding for NOAA Climate Research",
      "White House Budget Would Slash Funding for NOAA Climate Research",
      "Trump budget cuts would eliminate much of NOAA’s climate research"
    ]
  },
  {
    "Topic": 9,
    "Count": 1729,
    "Name": "9_heat_pump_pumps_heating",
    "Representation": [
      "heat",
      "pump",
      "pumps",
      "heating",
      "boiler",
      "cooling",
      "ac",
      "gas",
      "it",
      "with"
    ],
    "Representative_Docs": [
      "I have heat pump, it’s true. I also have water radiator with gas boiler. I use that mostly for winter because it thrives on cold draft to covert it to heat. My heat pump struggled to keep up, costing me too much money",
      "We installed one last year. We love it. It's a hybrid, which means it has heating elements if we need more hot water than the heat pump can supply, we don't need them. We get all the hot water we need from the heat pump.",
      "With no heat pump, it must rely on resistance. That sounds expensive around here where gas energy is 16 the price of electricity. Maybe 14 with variable electric pricing. In combination with a heat pump, it would be excellent for bridging extreme cold snaps when heat pumps don't function well."
    ]
  },
  {
    "Topic": 10,
    "Count": 1722,
    "Name": "10_solar_panels_power_roof",
    "Representation": [
      "solar",
      "panels",
      "power",
      "roof",
      "my",
      "battery",
      "rooftop",
      "have",
      "the",
      "to"
    ],
    "Representative_Docs": [
      "Solar panels on the roof of a data center. Is possible. How much of the energy they are using are they already creating?",
      "In an effort to go solar, we installed solar shingles and incorporated these panels into our roof project. These are unlike typical solar panels. No wind drag on the roof during hurricanes and no added weight. They look pretty good too. They’re up there finally. Can’t wait turn them on!!!",
      "Too bad the rest of us with homes can't use it to do things like put solar panels on the roof."
    ]
  },
  {
    "Topic": 11,
    "Count": 1696,
    "Name": "11_he_his_hes_him",
    "Representation": [
      "he",
      "his",
      "hes",
      "him",
      "trump",
      "environment",
      "climate",
      "change",
      "is",
      "environmental"
    ],
    "Representative_Docs": [
      "Does Trump understand that the environmental impacts of his policies will hurt his grandchildren and their children? Or is he that much of a psychopath that he doesn't care?",
      "look he himself has said that no single person on earth has done more the environment than him. and he's a genius. so he must be right.",
      "Trump is an old rich man dying. He knows he won't be around to face most of climate change's consequences so he's burning the world down to serve his own greed - and maybe on some level he knows he is despised and that most of us will celebrate his death, so he's trashing the planet as revenge."
    ]
  },
  {
    "Topic": 12,
    "Count": 1572,
    "Name": "12_wind_offshore_windmills_turbines",
    "Representation": [
      "wind",
      "offshore",
      "windmills",
      "turbines",
      "project",
      "farm",
      "construction",
      "york",
      "trump",
      "empire"
    ],
    "Representative_Docs": [
      "Trump Administration Halts Construction on New York Offshore Wind Project - Inside Climate News insideclimatenews.orgnews1804202...",
      "Trump Administration Halts Construction on New York Offshore Wind Project - Inside Climate News insideclimatenews.orgnews1804202...",
      "Trump administration issues order to stop construction on New York offshore wind project. ClimateCrisis apnews.comarticlewind..."
    ]
  },
  {
    "Topic": 13,
    "Count": 1554,
    "Name": "13_change_climate_denial_we",
    "Representation": [
      "change",
      "climate",
      "denial",
      "we",
      "it",
      "is",
      "science",
      "that",
      "not",
      "will"
    ],
    "Representative_Docs": [
      "\"Why would experts in climate science say global climate change is not an issue\" oh its because they aren't actually experts in the field, but hey when they do it for climate change you are like \"This is fake\" but if they do it for trans healthcare \"NOPE I BELIEVE THESE FUCKS\"",
      "And the denial of that is same as with climate change we know the damage is done, we know it’s coming and yet",
      "They are going for the \"hear no climate change, speak no climate change, see no climate change\" approach."
    ]
  },
  {
    "Topic": 14,
    "Count": 1543,
    "Name": "14_water_sewage_companies_ownership",
    "Representation": [
      "water",
      "sewage",
      "companies",
      "ownership",
      "public",
      "private",
      "pollution",
      "to",
      "for",
      "the"
    ],
    "Representative_Docs": [
      "Private water companies have been dumping sewage and letting infrastructure crumble for over 30 years. Sign the petition to bring water into public ownership WeOwnIt weownit.org.ukact-nowlets...",
      "Private water companies have been dumping sewage and letting infrastructure crumble for over 30 years. Sign the petition to bring water into public ownership WeOwnIt weownit.org.ukact-nowlets...",
      "Private water companies have been dumping sewage and letting infrastructure crumble for over 30 years. Sign the petition to bring water into public ownership WeOwnIt weownit.org.ukact-nowlets..."
    ]
  },
  {
    "Topic": 15,
    "Count": 1456,
    "Name": "15_prices_gas_oil_price",
    "Representation": [
      "prices",
      "gas",
      "oil",
      "price",
      "down",
      "198",
      "crude",
      "are",
      "lower",
      "trump"
    ],
    "Representative_Docs": [
      "Letter to the editor Oil prices vs. gas prices httpstriblive.comopinionletter-to-the-editor-oil-prices-vs-gas-prices",
      "Gas and oil prices are not directly linked. Gas prices are dropping, but that is NOT driving down OIL prices. Gas price declines are a sign of shrinking demand. That eventually spills over to oil itself. Not as fast as a slight hike in oil prices leads to a near-instant gas price hike....",
      "Gas prices drive energy prices gas power and the price cap is set on past prices so you can look at spot prices recently and see that the drop off in gas prices due to Trump is going to lead to this effect falling off in 3-6 months time"
    ]
  },
  {
    "Topic": 16,
    "Count": 1452,
    "Name": "16_green_my_it_you",
    "Representation": [
      "green",
      "my",
      "it",
      "you",
      "one",
      "im",
      "so",
      "like",
      "but",
      "the"
    ],
    "Representative_Docs": [
      "Green. Green is bad. Green is against god's design. \"these green new deal’ policies that really go against God’s design for nature\" Green grass is bad. Green leafies is bad. I did not alter the color of the image",
      "so green so green so green so green so green so green so green so green so green so green so green so green so green so green so green so green so green",
      "It says they can be green but they can’t be green. I have no use for them being green but it’s just curious that they won’t be green that’s all"
    ]
  },
  {
    "Topic": 17,
    "Count": 1373,
    "Name": "17_energy_you_your_it",
    "Representation": [
      "energy",
      "you",
      "your",
      "it",
      "this",
      "my",
      "to",
      "that",
      "like",
      "do"
    ],
    "Representative_Docs": [
      "We needed a little more of this energy the first go-around and we need a lot more of it now.",
      "The energy you put out comes right back to you. That’s it that’s all",
      "This is the energy we need today. Take The Power Back. youtu.beihto81cBmqU?..."
    ]
  },
  {
    "Topic": 18,
    "Count": 1338,
    "Name": "18_emission_abstract_type_announce",
    "Representation": [
      "emission",
      "abstract",
      "type",
      "announce",
      "of",
      "models",
      "quantum",
      "model",
      "energy",
      "new"
    ],
    "Representative_Docs": [
      "arXiv2504.10584v1 Announce Type new Abstract High-resolution, near-ground wind-speed data are critical for improving the accuracy of weather predictions and climate models,1-3 supporting wildfire control efforts,4-7 and ensuring the safe 17 of httpsarxiv.orgabs2504.10584v1",
      "arXiv2504.12000v1 Announce Type new Abstract Data-driven flow control has significant potential for industry, energy systems, and climate science. In this work, we study the effectiveness of Reinforcement Learning RL for reducing convective heat 15 of httpsarxiv.orgabs2504.12000v1",
      "arXiv2504.12000v1 Announce Type new Abstract Data-driven flow control has significant potential for industry, energy systems, and climate science. In this work, we study the effectiveness of Reinforcement Learning RL for reducing convective heat 15 of httpsarxiv.orgabs2504.12000v1"
    ]
  },
  {
    "Topic": 19,
    "Count": 1328,
    "Name": "19_tariffs_tariff_trade_trump",
    "Representation": [
      "tariffs",
      "tariff",
      "trade",
      "trump",
      "trumps",
      "us",
      "manufacturing",
      "energy",
      "will",
      "the"
    ],
    "Representative_Docs": [
      "Businesses have put things on hold in a climate of uncertainty. Trump's on-againoff-again tariffs have done just that. No new US factories. Ship offshore any manufacturing destined for sales to other countries just to avoid tariffs. Not self-fulfilling, but inevitable in this climate.",
      "Trump doesn't realize that his tariffs will cut down on green house gases. Buy local. tariffs savetheplanet",
      "Trump tariffs deal damage to U.S. solar httpswww.europesays.com1976161 Trump tariffs deal damage to U.S. solar Trump tariffs deal damage to U.S. solar by ObtainSustainability"
    ]
  },
  {
    "Topic": 20,
    "Count": 1241,
    "Name": "20_autism_rfk_jr_environmental",
    "Representation": [
      "autism",
      "rfk",
      "jr",
      "environmental",
      "factors",
      "toxins",
      "vaccines",
      "kennedy",
      "he",
      "autistic"
    ],
    "Representative_Docs": [
      "He said in this video that autism is an environmental disease that is preventable. This is 100% false. Autism is not preventable, it is genetic and not caused by the environment. Many kids with autism grow up and lead perfectly productive and normal lives just like all of us do. RFK Jr is a danger",
      "RFK JR now says the environment causes autism? and autism is an epidemic? Says people will autism will never hold a job and pay taxes? What kind of fucking moron is this? This is your head of health and human services people.. smh",
      "So just like that it’s no longer vaccines that cause autism? Did I get that right? RFK Jr. plans autism studies aimed at identifying 'environmental toxins' linked to rising rates"
    ]
  },
  {
    "Topic": 21,
    "Count": 1224,
    "Name": "21_temperature_snow_summer_degrees",
    "Representation": [
      "temperature",
      "snow",
      "summer",
      "degrees",
      "weather",
      "spring",
      "temperatures",
      "april",
      "heat",
      "winter"
    ],
    "Representative_Docs": [
      "Have just been out at lunch someone said don’t you love this late summer heat? To which I replied it’s not late-summer heat, it’s APRIL. This is global warming it’s NOT GOOD. And the response was oh well, at least it’s warm - I hate winter. I am seriously reconsidering my life choices.",
      "It's 35 degrees tomorrow where I am. They say global warming and climate change don't exist, aren't a threat. It has been a month and 10 days into autumn and we still have summer weather and temperatures. Fuck this shit. I am so over it.",
      "Vancouver Island, where I used to live,has had a climate shift, too. It is colder in winter and more snow and far hotter in summer now than when I was a kiddo. Last winter I was there,two yrs ago we got about 2 ft of snow overnight, and it was-18°C for almost a week. Paralyzed the whole city"
    ]
  },
  {
    "Topic": 22,
    "Count": 1214,
    "Name": "22_cars_transport_car_bike",
    "Representation": [
      "cars",
      "transport",
      "car",
      "bike",
      "cycling",
      "transit",
      "bus",
      "congestion",
      "public",
      "buses"
    ],
    "Representative_Docs": [
      "Hey, edinburghcouncil.bsky.social, we can change too! Edinburgh is a great city for cycling despite the weather but more needs to be done. Shifting from cars to bikes and public transport is a benefit for all.",
      "People who only drive need to understand that cutting transit funding will make roads busier, and it will cost much more money than they cut to fund the increased road use. Also cars pollute the city much more in terms of noise, emissions and particulates.",
      "My response to it is that cars are still cars. Traffic, pollution, and all other negative externalities aren't because of drivers per se, but because they're driving CARS. A person walking, cycling, or taking transit won't affect the same level of damage."
    ]
  },
  {
    "Topic": 23,
    "Count": 1128,
    "Name": "23_bluesky_climate_on_and",
    "Representation": [
      "bluesky",
      "climate",
      "on",
      "and",
      "our",
      "for",
      "to",
      "with",
      "of",
      "the"
    ],
    "Representative_Docs": [
      "I think I need to make a thread that has been a long time in the making. A lot of why you don't see me on here are societal and energy issues. I wanted to do a lot on BlueSky but the main reason I haven't is because I can't deal with the societal issues going on.",
      "If you see this, quote with the energy you bring to BlueSky.",
      "Good to run into again on BlueSky Brian and quite nice to notice your post because it was interacting with your representative repdexteror.bsky.social since we both know by now that the actual climate action we desperately need is only going to come if we can build up the political will for it"
    ]
  },
  {
    "Topic": 24,
    "Count": 1127,
    "Name": "24_game_art_games_environment",
    "Representation": [
      "game",
      "art",
      "games",
      "environment",
      "artist",
      "storytelling",
      "portfolioday",
      "environmental",
      "my",
      "im"
    ],
    "Representative_Docs": [
      "Hi ! PortfolioDay ! I'm Thomas a french 3D Environment artist. I love making stylized art and Ho! I love drawing too ! Looking for work, specially in France. Any advice is welcome ! thomgilbertorange.fr httpswww.artstation.comtomart04 httpslinktr.eeartom3d",
      "Collection of some environment painting studies from Sky Children of the Light I made back in 2022. I haven't played the game in ages but I still adore these and want to try this with other games. art skychildrenofthelight environment-art skyCOTL",
      "Happy PortfolioDay! I'm Jon, a 3D Stylized Environment Artist from the US! I have 2 years of game industry experience and am currently open to freelance, contract, and full-time work! httpartstation.comjonathanma JonathanMa3doutlook.com"
    ]
  },
  {
    "Topic": 25,
    "Count": 1083,
    "Name": "25_shipping_ships_emissions_maritime",
    "Representation": [
      "shipping",
      "ships",
      "emissions",
      "maritime",
      "imo",
      "cruise",
      "global",
      "international",
      "ship",
      "carbon"
    ],
    "Representative_Docs": [
      "The IMO has agreed for a global price on carbon for shipping. As far as I know the first industry to do so.",
      "Happy news for today Major shipping nations have agreed to the world’s first global fee on greenhouse gas emissions from ships! The 100-per-ton charge will fund cleaner technologies and support developing countries, significantly cutting pollution and boosting green shipping worldwide.",
      "Countries agree to global carbon tax on shipping, opposed by Trump The agreement, which the Trump administration opposes, makes the shipping industry the first to face international binding emissions targets. httpswww.europesays.com1988312 Countries agree to global carbon tax on"
    ]
  },
  {
    "Topic": 26,
    "Count": 1067,
    "Name": "26_ev_evs_electric_charging",
    "Representation": [
      "ev",
      "evs",
      "electric",
      "charging",
      "cars",
      "car",
      "vehicles",
      "vehicle",
      "an",
      "charge"
    ],
    "Representative_Docs": [
      "We're talking EVs! From celebrating EVs passing 10% market share to touring an electric school bus plant to reporting on his 1,400-mile EV road trip, our Electric Transportation Director is sharing the 3 things you need to know about EVs right now ow.ly39Fa50VyjlK",
      "This last point should be your first. The big offset to the higher costs of the vehicle is it being cheap to operate. And that really only happens if you’re charging where you park at residential electric rates. I can’t make an EV work for you financially if you have to pay charging station prices",
      "50 annual fee for EVs seems reasonable and much less than whatever gas tax one would pay for the year. EV httpswww.khon2.comlocal-newshawaii-ev-owners-to-face-new-road-charges-starting-julyamp"
    ]
  },
  {
    "Topic": 27,
    "Count": 1047,
    "Name": "27_housing_homes_planning_sprawl",
    "Representation": [
      "housing",
      "homes",
      "planning",
      "sprawl",
      "cities",
      "nature",
      "green",
      "building",
      "city",
      "new"
    ],
    "Representative_Docs": [
      "This article arguing for more single-family housing is in the NEW YORK Times. New York City is the greenest city in the country per capita and arguably in the world exactly because of its high-rise housing. We don't need sprawl, we need planning from people who are not this stupid.",
      "For example \"From a policy perspective, we should perhaps focus our remaining emissions budget solely on the gap in the housing market on making new public housing and encouraging community-led housing...As mazzucatom.bsky.social I note, housing is affordable if it is made affordable\"",
      "It is not possible to address climate given the sprawl of the US without some combination of EVs and density. Housing needs will also increase due to climate related migration and housing destroyed by climate itself. If you want lots of social housing you should want something like an.."
    ]
  },
  {
    "Topic": 28,
    "Count": 1028,
    "Name": "28_hydrogen_h2_green_fuel",
    "Representation": [
      "hydrogen",
      "h2",
      "green",
      "fuel",
      "ammonia",
      "energy",
      "of",
      "for",
      "production",
      "is"
    ],
    "Representative_Docs": [
      "Almost all hydrogen is made by burning fossil fuels. Anything powered by hydrogen therefore produces more net greenhouse gases, not less. Hydrogen is dangerous and crazy expensive to distribute. Wind, solar, hydro and batteries and even nuclear are way better options.",
      "This argument makes no sense sadly. Hydrogen is very expensive. Do you know how much hydrogen stations cost to implement? Your numbers do not add up. I have not seen any major move towards hydrogen heavy transport. It’s not going to happen I’m afraid.",
      "This argument makes no sense sadly. Hydrogen is very expensive. Do you know how much hydrogen stations cost to implement? Your numbers do not add up. I have not seen any major move towards hydrogen heavy transport."
    ]
  },
  {
    "Topic": 29,
    "Count": 934,
    "Name": "29_tesla_musk_elon_teslas",
    "Representation": [
      "tesla",
      "musk",
      "elon",
      "teslas",
      "he",
      "cars",
      "his",
      "car",
      "bought",
      "credits"
    ],
    "Representative_Docs": [
      "Elon Musk Unveils New Clean Energy Luxury Car Pulled By 8 Tesla Employees theonion.comelon-musk-un...",
      "Tesla, Musk politics Where do we draw the line? The backlash against Elon Musk is understandable, but does targeting Tesla risk undermining the EV movement? With Trump Musk aligning on climate rollbacks, it's time to be strategic, not reactionary. ClimateAction EVs Tesla",
      "Tesla's are great cars Elon is the piece of shit that is the problem, not the vehicles Save Tesla, Fire Elon End Elon's ownership of any thing to do with Tesla Climate Change will thank you"
    ]
  },
  {
    "Topic": 30,
    "Count": 908,
    "Name": "30_lng_eu_gas_us",
    "Representation": [
      "lng",
      "eu",
      "gas",
      "us",
      "europe",
      "natural",
      "russian",
      "liquefied",
      "energy",
      "imports"
    ],
    "Representative_Docs": [
      "The Hidden Climate Costs of Exporting US Liquefied Natural Gas httpsinsideclimatenews.orgnews16042025liquefied-natural-gas-exports-greenhouse-gas-emissions An exclusive Inside Climate News analysis found that a single year of greenhouse gas emissions from tankers carrying LNG from the",
      "The US was a major LNG supplier to the EU, with almost half of the EU's 2024 LNG imports coming from the US. And despite EU efforts to reduce reliance on Russian gas, imports of Russian gas rose by 18% in 2024.",
      "China just ended US LNG imports. Those imports only represented 3% of the LNG actually going into China BUT Chinese companies accounted for 91% of worldwide purchases of LNG on long-term contracts. So all eyes on Europe. Reminder LNG climate wrecking ball www.nytimes.com20250418b..."
    ]
  },
  {
    "Topic": 31,
    "Count": 826,
    "Name": "31_laws_state_order_states",
    "Representation": [
      "laws",
      "state",
      "order",
      "states",
      "executive",
      "trump",
      "enforcement",
      "climate",
      "block",
      "policies"
    ],
    "Representative_Docs": [
      "President Trump signed an executive order that directs the Attorney General to stop the enforcement of State laws on climate change.",
      "Illegal and Unconstitutional’ Trump Signs Executive Order to Block Enforcement of State Climate Laws",
      "Illegal and Unconstitutional’ Trump Signs Executive Order to Block Enforcement of State Climate Laws"
    ]
  },
  {
    "Topic": 32,
    "Count": 822,
    "Name": "32_greenhouse_grow_plants_greenhouses",
    "Representation": [
      "greenhouse",
      "grow",
      "plants",
      "greenhouses",
      "grass",
      "garden",
      "plant",
      "my",
      "tomatoes",
      "seeds"
    ],
    "Representative_Docs": [
      "Bookdrop booksky Gardening DIY greenhouse The-Chinese-Greenhouse Design and Build a Low-Cost, Passive-Solar Greenhouse a full guide to DIY passive solar greenhouses for self-sufficiency growing year-round in soil or hydroponic with no additional heat. os5.mycloud.comactionshare...",
      "I don’t know. I think a real greenhouse has some sort of an electric, heat ability.. Mine is just small more like a cold frame than actual greenhouse. I have a card table in my living room with grow lights where I started tomatoes, peppers, and eggplant last month. 1",
      "Damn. This one didn’t post with my last post Here’s more of the new plants There was a greenhouse in this area. We never had any plans to use the greenhouse. This is much better to look at as it’s right in the front yard."
    ]
  },
  {
    "Topic": 33,
    "Count": 797,
    "Name": "33_march_europe_record_warmest",
    "Representation": [
      "march",
      "europe",
      "record",
      "warmest",
      "2024",
      "temperature",
      "average",
      "temperatures",
      "continent",
      "hottest"
    ],
    "Representative_Docs": [
      "Europe is the world’s fastest-warming continent and 2024 was the warmest year on record, with record temperatures in the central, eastern and southeastern regions. Europe's glaciers are probably gone in decades. The continent will experience serious impacts from climate change and extreme weather.",
      "The European State of the Climate 2024 Report www.copernicus.euenmediaima... \"According to its findings, 2024 was the warmest year on record in Europe. Record-high annual temperatures were reached in around 48% of the continent, particularly in central, eastern, and southeastern Europe.\"",
      "March 2025 was the warmest March on record for Europe and the second-warmest March globally, with a global average surface air temperature of 14.06°C, 1.60°C above the pre-industrial level for March."
    ]
  },
  {
    "Topic": 34,
    "Count": 794,
    "Name": "34_china_rare_chinese_chinas",
    "Representation": [
      "china",
      "rare",
      "chinese",
      "chinas",
      "minerals",
      "us",
      "earth",
      "energy",
      "is",
      "the"
    ],
    "Representative_Docs": [
      "China is doing more clean energy times 10 more than us already",
      "China is doing more clean energy times 10 more than us already",
      "My understanding is that China dominates the rare-earth metals trade because it is willing to poison its own citizens and environment. Other countries would have viable rare-earth industries if China had strong environmental regulations because rare-earths aren't actually rare like, say, cobalt is."
    ]
  },
  {
    "Topic": 35,
    "Count": 791,
    "Name": "35_acid_coffee_carbonated_reflux",
    "Representation": [
      "acid",
      "coffee",
      "carbonated",
      "reflux",
      "drink",
      "tea",
      "carbonation",
      "drinks",
      "my",
      "like"
    ],
    "Representative_Docs": [
      "At my work at the moment I have no coffee machine to use, otherwise I'd be making coffee. Basically if I'm out and about and have no access to coffee, I'm getting that canned carbonated petroleum product baybeeeee",
      "You’re doing the things I love most, but the way my acid reflux set up, I can’t!!",
      "Then definitely give cold brew a try. It's the only way I can drink coffee without acid reflux happening."
    ]
  },
  {
    "Topic": 36,
    "Count": 789,
    "Name": "36_children_kids_anxiety_young",
    "Representation": [
      "children",
      "kids",
      "anxiety",
      "young",
      "climate",
      "change",
      "people",
      "have",
      "child",
      "not"
    ],
    "Representative_Docs": [
      "It’s not the birth rates that’s the issue. It’s the price tag of birth, the quality of life the parents view their children will have not just because of Trump but climate change which is worse than our own, the the lack of ability to meet people, and of course incels that makes children less cool",
      "People I know who are young enough to have kids 1 realize it’s expensive 2 would rather give a small number of kids lots of attention than have a bunch they can’t care for and 3 feel concern about having kids given climate change. That is, they are responsible, ethical, and sane. Unlike some.",
      "People I know who are young enough to have kids 1 realize it’s expensive 2 would rather give a small number of kids lots of attention than have a bunch they can’t care for and 3 feel concern about having kids given climate change. That is, they are responsible, ethical, and sane. Unlike some."
    ]
  },
  {
    "Topic": 37,
    "Count": 759,
    "Name": "37_nuclear_uranium_waste_energy",
    "Representation": [
      "nuclear",
      "uranium",
      "waste",
      "energy",
      "power",
      "reactors",
      "renewables",
      "is",
      "radioactive",
      "it"
    ],
    "Representative_Docs": [
      "\"why yes I did grow up next to a nuclear power plant, how did you know?\" THIS IS JUST A JOKE, NUCLEAR POWER IS CLEAN AND SAFE AND IS OUR ONLY CHANCE AGAINST CLIMATE CHANGE",
      "\"why yes I did grow up next to a nuclear power plant, how did you know?\" THIS IS JUST A JOKE, NUCLEAR POWER IS CLEAN AND SAFE AND IS OUR ONLY CHANCE AGAINST CLIMATE CHANGE",
      "This looks like they will be going after any state law or city ordinance that promotes decarbonization, renewable energy, energy efficiency, or keep out nuclear waste, new nuclear reactors, nuclear fuel production, uranium mines...."
    ]
  },
  {
    "Topic": 38,
    "Count": 740,
    "Name": "38_steel_furnaces_scunthorpe_british",
    "Representation": [
      "steel",
      "furnaces",
      "scunthorpe",
      "british",
      "blast",
      "uk",
      "nationalise",
      "iron",
      "arc",
      "coking"
    ],
    "Representative_Docs": [
      "The US steel industry is already focused around recycling steel in EAFs European countries are looking to this kind of future too, backed up by some big investments in clean iron making. Global steel buyers are looking for cleaner steel. 35",
      "This is about steel and oil. We need steel and we need no fossil fuels. It's not rocket science.",
      "British Steel has said that electric arc furnace technology can make all steel grades and products, and steel is the main raw material used in wind turbines. Hence, decarbonising the steel industry is a highly critical part of moving towards net zero."
    ]
  },
  {
    "Topic": 39,
    "Count": 732,
    "Name": "39_air_pollution_clean_quality",
    "Representation": [
      "air",
      "pollution",
      "clean",
      "quality",
      "health",
      "schools",
      "asthma",
      "in",
      "airpollution",
      "smog"
    ],
    "Representative_Docs": [
      "If we get an idea of the level of outdoor air pollution in India by seeing data from when it was reduced during Covid-19, we can imagine what indoor air pollution, shown to be mostly worse, might be! or just living in Northern India, as I also did for 4 years!",
      "Air pollution, air pollution, air pollution. Everyone says this right after location.",
      "Air Pollution in China Real-time Air Quality Index Visual Map aqicn.orgmapchina"
    ]
  },
  {
    "Topic": 40,
    "Count": 732,
    "Name": "40_renewables_electricity_renewable_40",
    "Representation": [
      "renewables",
      "electricity",
      "renewable",
      "40",
      "energy",
      "2024",
      "clean",
      "global",
      "power",
      "generation"
    ],
    "Representative_Docs": [
      "UPLIFTING NEWS World surges past 40% clean power in record renewables boom. Renewables and nuclear provided 40.9% of the world’s power generation in 2024, passing the 40% mark for the first time since the 1940s, according to a new Ember report.",
      "Now, 40% of global electricity, is from renewables. ember-energy.orglatest-insig...",
      "Renewables generation grew by a record amount in 2024, pushing clean power to 40% of global power output, according to think tank Ember’s Global Electricity Review 2025 windpower renewables energytransition tinyurl.commpd8mb95"
    ]
  },
  {
    "Topic": 41,
    "Count": 727,
    "Name": "41_wood_burning_stove_stoves",
    "Representation": [
      "wood",
      "burning",
      "stove",
      "stoves",
      "burners",
      "woodburning",
      "smoke",
      "burner",
      "areas",
      "pollution"
    ],
    "Representative_Docs": [
      "I love wood stoves and hate that a gas stove is actually better at temperature control",
      "Moving won't help. Even if you moved to an area that had no wood burning stoves, there's nothing stopping your neighbours from installing one. We need to phase out wood burning, with help from the government.",
      "Moving won't help. Even if you moved to an area that had no wood burning stoves, there's nothing stopping your neighbours from installing one. We need to phase out wood burning, with help from the government."
    ]
  },
  {
    "Topic": 42,
    "Count": 727,
    "Name": "42_wildfires_wildfire_fires_fire",
    "Representation": [
      "wildfires",
      "wildfire",
      "fires",
      "fire",
      "risk",
      "scotland",
      "forest",
      "uk",
      "drought",
      "climatecrisis"
    ],
    "Representative_Docs": [
      "Wildfire smoke and mental health Exposure to wildfire-specific PM2.5 during California’s 2020 wildfires has been linked to more emergency visits for mental health, especially for women, children, marginalised communities. jamanetwork.comjournalsjam... Pollution Wildfires SciComm",
      "Wildfires in 2024 -Nature Wildfire Climate Forest More info from EcoSearch",
      "Emergency Forest Cutting Will Exacerbate Wildfires -The Wildlife News Wildfire Forest Climate More info from EcoSearch"
    ]
  },
  {
    "Topic": 43,
    "Count": 718,
    "Name": "43_canada_alberta_oil_energy",
    "Representation": [
      "canada",
      "alberta",
      "oil",
      "energy",
      "canadian",
      "canadas",
      "ontario",
      "albertans",
      "gas",
      "to"
    ],
    "Representative_Docs": [
      "Nuclear power generation, which is a source of energy that does not emit greenhouse gases, accounted for approximately 14% of Canada's electricity in 2021. Natural Resources Canada. Canada does not wholely rely on nuclear power Peter Dutton. natural-resources.canada.caminerals-min...",
      "Canada needs to become independent of the US. This is an interesting alternative. We could power greenhouses with solar and wind energy. cdnpoli canada",
      "Canada can become the world’s leading energy superpower by 1. working to reduce oil and gas emissions in a cost effective and efficient manner 2. getting more clean energy projects built quickly across Canada 3. investing in critical minerals and 4. securing Canada’s electricity sovereignty."
    ]
  },
  {
    "Topic": 44,
    "Count": 672,
    "Name": "44_book_fiction_books_poetry",
    "Representation": [
      "book",
      "fiction",
      "books",
      "poetry",
      "poem",
      "read",
      "climate",
      "story",
      "my",
      "booksky"
    ],
    "Representative_Docs": [
      "reading this book whew, intense stuff! but amazingly well discussed and overall the focus of the book is on positive changes we can still make in the environment I want to read it slowly so I can really take it all in",
      "A great environment speculative fiction environmental fiction novel",
      "ATTN ALL POETRY READERS NATURE LOVERS Poetry in Place Poetry and Environmental Hope in a Southern Ontario Bioregion, published by guernicaeditions.bsky.social, goes on sale May 1. Information about the book’s launch events will be regularly posted here, along with news about the book!"
    ]
  },
  {
    "Topic": 45,
    "Count": 671,
    "Name": "45_she_her_shes_was",
    "Representation": [
      "she",
      "her",
      "shes",
      "was",
      "to",
      "climate",
      "that",
      "the",
      "and",
      "who"
    ],
    "Representative_Docs": [
      "You seem to don’t seem to comprehend service for your country. She is doing what ever she can to save the environment, and bless her for it. It must be awful and gross for her to do it. But she is putting her constituents and the environment first.",
      "Because our state is the 1 area being decimated by his tariffs already and parts of the state have had massive flooding and ice storms. It's called she's doing her job for her state. Does she look like she was having fun?",
      "She did not. She said she will continue to do it despite the climate"
    ]
  },
  {
    "Topic": 46,
    "Count": 664,
    "Name": "46_earth_day_april_celebrate",
    "Representation": [
      "earth",
      "day",
      "april",
      "celebrate",
      "earthday",
      "22",
      "celebration",
      "join",
      "month",
      "pm"
    ],
    "Representative_Docs": [
      "Celebrate Earth Day with your community! This year’s Earth Day Festival will be held on Sunday, April 27 at Durham Central Park. Find out how you and your family can help drive positive change for our environment on Bull City Today.",
      "The theme for Earth Day 2025 on Tuesday 22 April is Our Power, Our Planet, which invites everyone around the world to unite behind renewable energy. There are many ways you can get involved and make a difference for our planet on Earth Day and every day bit.ly4jxbmZ7",
      "The theme for Earth Day 2025 on Tuesday 22 April is Our Power, Our Planet, which invites everyone around the world to unite behind renewable energy. There are many ways you can get involved and make a difference for our planet on Earth Day and every day bit.ly4jxbmZ7"
    ]
  },
  {
    "Topic": 47,
    "Count": 645,
    "Name": "47_song_music_album_listen",
    "Representation": [
      "song",
      "music",
      "album",
      "listen",
      "fire",
      "nowplaying",
      "my",
      "arena",
      "songs",
      "wind"
    ],
    "Representative_Docs": [
      "swevens.hearnow.comgo-back-in-t... Please listen to my song about climate change!",
      "i just listened to solar power by lorde 3 times straight. not the song the ALBUM",
      "Choose 20 albums that have stayed with you or influenced you. One album per day for 20 days, in no particular order. MusicSky Music MusicChallenge 4182025 Day 620 This album helped me understand our current political climate a little more, Specifically the song \"Bad Man\""
    ]
  },
  {
    "Topic": 48,
    "Count": 579,
    "Name": "48_fossil_fuels_fuel_subsidies",
    "Representation": [
      "fossil",
      "fuels",
      "fuel",
      "subsidies",
      "we",
      "industry",
      "the",
      "companies",
      "are",
      "oil"
    ],
    "Representative_Docs": [
      "Well, that's good. It's much better than providing subsidies to the fossil fuel industry",
      "Despite \"clean, renewable energy, government action to limit fossil fuels has been slow and inadequate. Fossil fuel companies still receive massive government subsidies, governments are still expanding fossil fuel production and infrastructure, and global fossil fuel emissions continue to rise\"",
      "Do you actually know what the fossil fuel subsidies actually are ?"
    ]
  },
  {
    "Topic": 49,
    "Count": 577,
    "Name": "49_zero_net_netzero_2050",
    "Representation": [
      "zero",
      "net",
      "netzero",
      "2050",
      "to",
      "the",
      "is",
      "by",
      "for",
      "it"
    ],
    "Representative_Docs": [
      "So many flaws in this piece. Here's four 1. Net zero cutting 100% of carbon emissions. Basic stuff. 2. Aim of net zero law was not to make steelmaking more expensive 3. No evidence as to why \"net zero in one country policies are simplistic\" 4. This is a U-turn, apparently, but we're not told how",
      "If we want to get net carbon emissions to zero, we need to get non-emitting transportation in place where it’s actually used, as is now legislated in most countries. If we want to transform society to some ideal, then we will fail to get net emissions to zero. I’d rather have net zero",
      "Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero! Zero!"
    ]
  },
  {
    "Topic": 50,
    "Count": 572,
    "Name": "50_monoxide_leak_gas_carbon",
    "Representation": [
      "monoxide",
      "leak",
      "gas",
      "carbon",
      "gaslighting",
      "detector",
      "detectors",
      "poisoning",
      "smoke",
      "alarms"
    ],
    "Representative_Docs": [
      "Didn’t you have carbon monoxide poisoning too. That probably did more than the microplastics.",
      "A few years ago our carbon monoxide alarm went off in the night. I got up and was greeted by a house full of smoke. The smoke detectors hadn’t gone off. Long story short, that carbon monoxide detector saved our lives.",
      "I feel like there's a carbon monoxide leak and it's figured out how to post"
    ]
  },
  {
    "Topic": 51,
    "Count": 514,
    "Name": "51_carney_carneys_tax_he",
    "Representation": [
      "carney",
      "carneys",
      "tax",
      "he",
      "mark",
      "carbon",
      "his",
      "canada",
      "pp",
      "hes"
    ],
    "Representative_Docs": [
      "Carney was appointed Governor of the Bank of Canada by the Cabinet controlled by Stephen Harper in 2008. Carney's tax cuts economic promises are ripped from Harper's 2008 Economic Action Plan. Carney recently quietly cut environmental science funding. Carney cut the Gender Equality Minister.",
      "Responsible mining, with high safety and environmental standards, carney will create jobs and a good reputation for Canada and help the environmentwin win win.PP will claim the idea or go back to carbon tax or some such PP bs, PM Carney has a vision for Canadas future, vote carney",
      "PP looking at Carney Industrial carbon tax is what Trump wants. It will raise price of cars. Carney End oil and gas subsidies agreeing with Singh. Move ahead with carbon capture and storage still unproven whether that works. Carney PP has no climate plan. That’s true."
    ]
  },
  {
    "Topic": 52,
    "Count": 499,
    "Name": "52_pressure_water_shower_flow",
    "Representation": [
      "pressure",
      "water",
      "shower",
      "flow",
      "showers",
      "showerheads",
      "executive",
      "order",
      "heads",
      "he"
    ],
    "Representative_Docs": [
      "President Trump signs an executive order to repeal Biden-era water conservation rules, lifting restrictions on water pressure in showers. Declaring \"shower freedom,\" Trump says, \"I like to take a nice shower to take care of my beautiful hair.\" Critics call it an anti-green move.",
      "He has zero understanding or caring about the whyswherefores of water conservation. And he mistakenly has said it's a problem with water pressure. No, low-flow shower heads can still deal with plenty of water pressure.",
      "Trump doesn’t just spend his days golfing. He signed a new executive order this week against the left’s war on water pressure, by rolling back rules requiring water-saving devices like low-flow showerheads. He explained In my case I like to take a nice shower, to take care of my beautiful hair."
    ]
  },
  {
    "Topic": 53,
    "Count": 492,
    "Name": "53_life_planet_atmosphere_k218b",
    "Representation": [
      "life",
      "planet",
      "atmosphere",
      "k218b",
      "dimethyl",
      "gases",
      "dms",
      "detected",
      "evidence",
      "gasses"
    ],
    "Representative_Docs": [
      "Scientists say they’ve found the strongest hint yet of life beyond our solar systemspotting gases in a distant planet’s atmosphere that, here on Earth, are only produced by living organisms. news.sky.comstorystrong...",
      "Scientists have found what they are calling the strongest sign yet of possible life beyond our solar system after detecting the chemical footprint of gases in an alien planet's atmosphere that on Earth are only produced by living organisms. .",
      "Scientists find 'strongest evidence yet' of life on distant planet ’The amount we estimate of this gas in the atmosphere is thousands of times higher than what we have on Earth,’ he said. 'So, if the association with life is real, then this planet will be teeming with life,’ he added."
    ]
  },
  {
    "Topic": 54,
    "Count": 487,
    "Name": "54_canada_canadian_canadians_canadas",
    "Representation": [
      "canada",
      "canadian",
      "canadians",
      "canadas",
      "election",
      "climate",
      "cdnpoli",
      "federal",
      "change",
      "wwwcbccanewsscience"
    ],
    "Representative_Docs": [
      "Canada's federal election doesn't seem like it's about climate change, but it actually is -The Conversation Election ClimateChange Democracy More info from EcoSearch",
      "Canada’s federal election doesn’t seem like it’s about climate change, but it actually is",
      "Canada's federal election doesn't seem like it's about climate change, but it actually is - The Conversation Canada"
    ]
  },
  {
    "Topic": 55,
    "Count": 486,
    "Name": "55_wolves_dire_deextinction_wolf",
    "Representation": [
      "wolves",
      "dire",
      "deextinction",
      "wolf",
      "species",
      "extinct",
      "animals",
      "extinction",
      "back",
      "bring"
    ],
    "Representative_Docs": [
      "If climate change is going the way it is. Might as well bring back the woolly mammoth and dire wolf.",
      "My take of the Dire Wolves. As a guy who became interested in science cause of his love of Jurassic Park and wanting to bring dinosaurs back, you don't have lie. They are not bring back Dire Wolves for sake of conservation they will burn in this climate. Just admit you just thought this was cool.",
      "Commentary De-extinct’ dire wolves hide humanity’s destruction of nature Biodiversity Biodiversity Crisis httpswww.channelnewsasia.comcommentarydire-wolf-extinct-conservation-nature-biodiversity-crisis-5066801"
    ]
  },
  {
    "Topic": 56,
    "Count": 452,
    "Name": "56_ocean_coral_reef_reefs",
    "Representation": [
      "ocean",
      "coral",
      "reef",
      "reefs",
      "marine",
      "bleaching",
      "sea",
      "oceans",
      "corals",
      "whales"
    ],
    "Representative_Docs": [
      "New rules walkthrough for our Benthos deckbuilding game! See how to compete for dominance of the reef as Coral or Algae using Reef Creatures , Microbes , Events like Coral Spawning , Carbon Pollution , Local Activism ! Print-and-play coming soon! youtu.beAtJ-yPzuGQM scicomm coral",
      "It isn't only the Great Barrier Reef bleaching. Ningaloo and Lord Howe Island coral reefs are bleaching too. Most of Australia's coral reefs have suffered bleaching from climate change ocean warming.",
      "By understanding these interactions, we can better protect marine communities, especially as coral reefs face devastating effects of ocean warming. But the impact doesn't stop there! The insights from this research could have major implications beyond the ocean, too."
    ]
  },
  {
    "Topic": 57,
    "Count": 443,
    "Name": "57_groups_sue_environmental_justice",
    "Representation": [
      "groups",
      "sue",
      "environmental",
      "justice",
      "trump",
      "administration",
      "status",
      "nonprofits",
      "taxexempt",
      "lawsuits"
    ],
    "Representative_Docs": [
      "Environmental and Science Groups Sue Trump Admin for Deleting Environmental Justice and Climate Information From Federal Agency Websites httpswww.europesays.com2001795 Environmental and Science Groups Sue Trump Admin for Deleting Environmental Justice and Climate Information From Federal",
      "apnews.comlivedonald-... and science groups sue Trump administration over removal of data on climate change and environmental justice",
      "Green groups sue Trump administration over climate webpage removals Green groups have sued the Trump administration over the removal of government webpages containing federal climate and environmental justice data that they described as tantamount to theft."
    ]
  },
  {
    "Topic": 58,
    "Count": 441,
    "Name": "58_poilievre_pierre_poilievres_tax",
    "Representation": [
      "poilievre",
      "pierre",
      "poilievres",
      "tax",
      "trudeau",
      "he",
      "his",
      "carbon",
      "carney",
      "canada"
    ],
    "Representative_Docs": [
      "Mr. Poilievre, you spent years running against Justin Trudeau and the carbon tax and they're both gone, Liberal Leader Mark Carney tells Conservative Leader Pierre Poilievre. EnglishDebate CanadaElection2025",
      "Pierre Poilievre does NOT have a plan to fight climate change. He advocates for the fossil fuel industry's preference for doing nothing. In his 20 years as an MP, Poilievre has voted against protecting the environment over 400 times. Pierre Poilievre cdnpoli",
      "Two key lines in the debate so far Carney to Poilievre \"You spent years running against Justin Trudeau and the carbon tax, but they are now both gone.\" Poilievre to Carney \"On housing we need a change, and you sir are not a change.\""
    ]
  },
  {
    "Topic": 59,
    "Count": 428,
    "Name": "59_lead_fluoridation_fluoride_water",
    "Representation": [
      "lead",
      "fluoridation",
      "fluoride",
      "water",
      "metals",
      "leaded",
      "toxic",
      "soil",
      "paint",
      "poisoning"
    ],
    "Representative_Docs": [
      "High levels of lead found in post-fire Eaton soil The lead likely came from paint used on older homes that burned. lapublicpress.org202504high...",
      "Lead is the most dangerous things affecting America today. Lead in its water supply, lead in old paint, lead that's being fired from guns and now lead in baby food. kidshealth.orgenparentsl...",
      "Lead paint has been banned in the US for a long time. Lead poisoning can come from flaking of old lead paint, lead in soil from leaded gasoline, which Europe took longer to ban actually, industrial pollution, lead pipes."
    ]
  },
  {
    "Topic": 60,
    "Count": 427,
    "Name": "60_mercury_plants_exempts_coal",
    "Representation": [
      "mercury",
      "plants",
      "exempts",
      "coal",
      "dozens",
      "pollution",
      "trump",
      "rule",
      "air",
      "70"
    ],
    "Representative_Docs": [
      "Trump exempts nearly 70 coal plants from Biden-era rule on mercury and other toxic air pollution apnews.comarticletrum...",
      "Trump exempts nearly 70 coal plants from Biden-era rule on mercury and other toxic air pollution httpswww.europesays.com1999359 Trump exempts nearly 70 coal plants from Biden-era rule on mercury and other toxic air pollution",
      "Trump exempts nearly 70 coal plants from Biden-era rule on mercury and other toxic air pollution"
    ]
  },
  {
    "Topic": 61,
    "Count": 420,
    "Name": "61_greens_green_party_vote",
    "Representation": [
      "greens",
      "green",
      "party",
      "vote",
      "policies",
      "the",
      "election",
      "they",
      "greenpartyorguk",
      "candidate"
    ],
    "Representative_Docs": [
      "I’m not in the Green Party nor did I post this specifically to attack the Green Party but to draw attention to a real danger this issue is being used to make urban green transition impossible. I hope the many sensible people in the Green Party Labour and LDs work together to counter this.",
      "I thought the Greens were about the environment! - fucking idiot who has no clue what the Greens are about. Like LMAO, you have nothing to do with the party, why tf do you think you have any grounds to stand on to say what they are an are not. Just stfu",
      "I thought the Greens were about the environment! - fucking idiot who has no clue what the Greens are about. Like LMAO, you have nothing to do with the party, why tf do you think you have any grounds to stand on to say what they are an are not. Just stfu"
    ]
  },
  {
    "Topic": 62,
    "Count": 412,
    "Name": "62_greenland_ukraine_russia_putin",
    "Representation": [
      "greenland",
      "ukraine",
      "russia",
      "putin",
      "arctic",
      "reproductive",
      "rights",
      "story",
      "climate",
      "helps"
    ],
    "Representative_Docs": [
      "I don’t get why Trump wants critical minerals from Greenland and Ukraine if he doesn’t believe in the energy transition.",
      "Land, resources and water. YES!!! Why? They know the climate crisis is real. See also Greenland.",
      "Greenland is leading the way accounting for 66% of the newly exposed land This is why Trump wants Greenland because he knows climate change is real and knows he can earn billions in mining Greenland despite fact that this means critical ocean current AMOC will shut down"
    ]
  },
  {
    "Topic": 63,
    "Count": 391,
    "Name": "63_political_dems_climate_democrats",
    "Representation": [
      "political",
      "dems",
      "climate",
      "democrats",
      "party",
      "change",
      "republicans",
      "republican",
      "about",
      "they"
    ],
    "Representative_Docs": [
      "You Democrats have been saying that the world is going to end and the climate change is coming!!!! AND you Democrats have been saying this for decades and nothing has happened yet and I hate people who hate our country just like all of you Democrats. President Trump is winning every single day.MAGA",
      "Our political systems are based on opposition. It is impossible to change one party without changing the other party. That's just observable reality. You should feel free to argue with it, but at that point you should understand how the climate change denial people came to be.",
      "Our political systems are based on opposition. It is impossible to change one party without changing the other party. That's just observable reality. You should feel free to argue with it, but at that point you should understand how the climate change denial people came to be."
    ]
  },
  {
    "Topic": 64,
    "Count": 389,
    "Name": "64_methane_emissions_gas_livestock",
    "Representation": [
      "methane",
      "emissions",
      "gas",
      "livestock",
      "cows",
      "seaweed",
      "cattle",
      "greenhouse",
      "from",
      "gwp"
    ],
    "Representative_Docs": [
      "PBS Farmers turn to seaweed in attempt to reduce methane emissions from livestock httpswww.pbs.orgnewshourshowfarmers-turn-to-seaweed-in-attempt-to-reduce-methane-emissions-from-livestock climate emissions methane cows",
      "Ah no. Apologies. That Methane from cows is less damaging than other sources of methane.",
      "One of the aspects of \"natural gas\" or methane we should be thinking about is transitioning from fossil methane to biological methane which will always be with us We should be pointing our infrastructure development toward capturing biological methane reducing fossil methane use to zero"
    ]
  },
  {
    "Topic": 65,
    "Count": 386,
    "Name": "65_ice_arctic_glaciers_sea",
    "Representation": [
      "ice",
      "arctic",
      "glaciers",
      "sea",
      "antarctic",
      "glacier",
      "melting",
      "antarctica",
      "warming",
      "mass"
    ],
    "Representative_Docs": [
      "Arctic sea ice reached a record-low maximum this winter. We are in a climate emergency.",
      "New technologies are helping to regrow Arctic sea ice. But should we use them? grist.orgclimatenew-... Arctic Ice Climate Technology Solarpunk Environment",
      "Sea Ice Melting Glaciers Arctic Antarctic Climate Change Global Warming"
    ]
  },
  {
    "Topic": 66,
    "Count": 377,
    "Name": "66_batteries_battery_wwwsciencedirectcomsciencearti_lithiumion",
    "Representation": [
      "batteries",
      "battery",
      "wwwsciencedirectcomsciencearti",
      "lithiumion",
      "renewableenergy",
      "storage",
      "batteryscience",
      "lithium",
      "cleanenergy",
      "energyresearch"
    ],
    "Representative_Docs": [
      "There Has Never Been a Better Time for EV Battery Swapping -Heatmap News RenewableEnergy Battery More info from EcoSearch",
      "Optimizing space, energy, and sustainability with advanced battery technology -Data Center Dynamics Battery RenewableEnergy Technology Sustainability More info from EcoSearch",
      "'We are beating lithium in the long-term' Allegro founder on microemulsion flow batteries -Energy Storage News RenewableEnergy Batteries More info from EcoSearch"
    ]
  },
  {
    "Topic": 67,
    "Count": 369,
    "Name": "67_birds_lowcarbonbirding_bird_pwc2025",
    "Representation": [
      "birds",
      "lowcarbonbirding",
      "bird",
      "pwc2025",
      "species",
      "migratory",
      "warbler",
      "patch",
      "yearlist",
      "nebirding"
    ],
    "Representative_Docs": [
      "2025 green patch yearlist thread, 13 April LowCarbonBirding NEBirding PWC2025 Then a Reed Warbler 112",
      "Indiana is planning to kill a lot of birds this year blaming them for crop destruction. We have noticeably fewer birds every year from bird flu, habitat loss, and climate, I truly don’t get it. We had way more birds in the 60s and it was never an issue that birds destroyed field crops.",
      "Indiana is planning to kill a lot of birds this year blaming them for crop destruction. We have noticeably fewer birds every year from bird flu, habitat loss, and climate, I truly don’t get it. We had way more birds in the 60s and it was never an issue that birds destroyed field crops."
    ]
  },
  {
    "Topic": 68,
    "Count": 356,
    "Name": "68_protest_protests_police_activists",
    "Representation": [
      "protest",
      "protests",
      "police",
      "activists",
      "climate",
      "protesters",
      "peaceful",
      "protesting",
      "activism",
      "gristorgprotestclim"
    ],
    "Representative_Docs": [
      "What do climate protests actually achieve? More than you think. The evidence is in Protests can persuade people, and maybe even change how they vote. grist.orgprotestclim... Protest Climate Environment Trump Greensky",
      "What do climate protests actually achieve? More than you think. The evidence is in Protests can persuade people, and maybe even change how they vote. grist.orgprotestclim... Protest Climate GreenSky Environment Trump",
      "What do climate protests actually achieve? More than you think. The evidence is in Protests can persuade people, and maybe even change how they vote. grist.orgprotestclim... Protest Climate Environment Trump Greensky"
    ]
  },
  {
    "Topic": 69,
    "Count": 355,
    "Name": "69_wind_chimes_windy_it",
    "Representation": [
      "wind",
      "chimes",
      "windy",
      "it",
      "my",
      "you",
      "me",
      "blowing",
      "its",
      "the"
    ],
    "Representative_Docs": [
      "Fallout wind, solar wind, ageostrophic wind. It's all the same to me.",
      "It is a typo . JFC, wind Wind WIND! You are the WIND beneath my wings.",
      "I would rather run up hill both ways with no wind than one way with a strong wind. I fucking hate wind."
    ]
  },
  {
    "Topic": 70,
    "Count": 351,
    "Name": "70_women_trans_men_gender",
    "Representation": [
      "women",
      "trans",
      "men",
      "gender",
      "womens",
      "climate",
      "woman",
      "people",
      "feminism",
      "political"
    ],
    "Representative_Docs": [
      "Instead of being a voice for women’s rights or our climate crisis these women do damage to both causes . What were they thinking?",
      "still cant get over that there are enough privileged trans girls in this current generation and climate politically to be able to fight each other over privilege this way and say they are too old to transition despite being way below the average of most other trans women P",
      "You should talk to some women, some trans people and some women officers and work it out. The thing that completely invalidates this judgement is that evidence from the trans folk was excluded. You have to work together, not easy in this climate."
    ]
  },
  {
    "Topic": 71,
    "Count": 348,
    "Name": "71_texas_bill_senate_wind",
    "Representation": [
      "texas",
      "bill",
      "senate",
      "wind",
      "texans",
      "tx",
      "solar",
      "ercot",
      "energy",
      "pvmagazineusacom20250416t"
    ],
    "Representative_Docs": [
      "Texas is a leading state in wind energy. We could learn from this.",
      "Texas is now broke without LNG sales to China municipalities will be available for hostile takeover in 9 months when they go bankrupt. No regulations in Texas. Means prices can go way up across Texas. Power shortages as municipal power cannot sell which requires rate increases on all users in Texas.",
      "These idiots in the Texas Senate. It should be noted that Texas is the LARGEST in the Utility Scale Solar Market of 50 Billion. This bill was to slow it down but this not only will kill it but it will raise Electric Bills in Texas. Hope the House rejects it. pv-magazine-usa.com20250416t..."
    ]
  },
  {
    "Topic": 72,
    "Count": 328,
    "Name": "72_datacentres_driest_techs_water",
    "Representation": [
      "datacentres",
      "driest",
      "techs",
      "water",
      "areas",
      "worlds",
      "microsoft",
      "wwwtheguardiancomenvironment",
      "revealed",
      "big"
    ],
    "Representative_Docs": [
      "Revealed Big tech’s new datacentres will take water from the world’s driest areas Amazon, Google and Microsoft are building datacentres in water-scarce parts of five continents Amazon, Microsoft and Google are operating datacentres that use vast amounts of water in some of the world’s d...",
      "Revealed Big tech’s new datacentres will take water from the world’s driest areas Amazon, Google and Microsoft are building datacentres in water-scarce parts of five continents",
      "Big tech’s new datacentres will take water from the world’s driest areas Amazon, Microsoft and Google are operating datacentres that use vast amounts of water in some of the world’s driest areas and are building many more, an investigation by SourceMaterial and the Guardian has found."
    ]
  },
  {
    "Topic": 73,
    "Count": 323,
    "Name": "73_noise_leaf_blowers_blower",
    "Representation": [
      "noise",
      "leaf",
      "blowers",
      "blower",
      "quieter",
      "pollution",
      "sound",
      "headphones",
      "sleep",
      "noisy"
    ],
    "Representative_Docs": [
      "I spent the last two days listening to gas leaf blowers and want nothing more than to ban them. Between the particulate pollution, noise, etc they are awful.",
      "forgot for a moment that i lived in hell and expected to be able to sleep on a saturday morning instead of having four hours of leaf blower noise pollution. anyway, death to all who use leaf blowers.",
      "forgot for a moment that i lived in hell and expected to be able to sleep on a saturday morning instead of having four hours of leaf blower noise pollution. anyway, death to all who use leaf blowers."
    ]
  },
  {
    "Topic": 74,
    "Count": 321,
    "Name": "74_fossils_fossil_fighters_zine",
    "Representation": [
      "fossils",
      "fossil",
      "fighters",
      "zine",
      "fossilfriday",
      "fossilized",
      "found",
      "rocks",
      "my",
      "it"
    ],
    "Representative_Docs": [
      "Thanks! It’s actually a piece of fossil soup so it’s full of little fossils. I love working with it.",
      "Thanks! It’s actually a piece of fossil soup so it’s full of little fossils. I love working with it.",
      "Good call out. Since rocks often have fossils in them and fossils used to be living things, are ricks truly vegan? Or are vegans being hypocrites for eating fossils?"
    ]
  },
  {
    "Topic": 75,
    "Count": 319,
    "Name": "75_uk_prices_energy_electricity",
    "Representation": [
      "uk",
      "prices",
      "energy",
      "electricity",
      "gas",
      "price",
      "costs",
      "market",
      "the",
      "cost"
    ],
    "Representative_Docs": [
      "The biggest issue in the UK’s energy market is the outdated pricing mechanism that ties electricity prices to the cost of gas. Cheap renewable power is being priced at the cost of expensive fossil fuels.",
      "Why are energy costs so much higher in the UK than in other countries and who gets the benefit of those higher prices ?",
      "This needs changing, NOT the move to Green energy. The main driver of price disparity is now wholesale electricity costs, driven by UK’s reliance on natural gas power generation. Gas set the price 98% of the time in UK, compared with about 40% on average across the EU."
    ]
  },
  {
    "Topic": 76,
    "Count": 317,
    "Name": "76_15c_tipping_warming_points",
    "Representation": [
      "15c",
      "tipping",
      "warming",
      "points",
      "3c",
      "global",
      "2100",
      "ipcc",
      "4c",
      "overshoot"
    ],
    "Representative_Docs": [
      "What does it mean to exceed and return to,,global warming of 1.5°C? httpswww.byteseu.com922430 Many national and corporate climate targets seek to limit global warming to 1.5°C. Yet, global warming continues to increase. It makes it almost inevitable that 1.5°C of global warming will be",
      "\"Tipping points\" are \"thresholds where a small additional change in global warming will cause major biophysical systems to irreversibly shift into a new state.\" Cascading tipping points occur when crossing one threshold triggers another, so on. We should be extremely scared of these. So...",
      "Exploring the risks of cascading’ tipping points in a warming world. The authors of a review study on cascading tipping points unpack the current state of scientific understanding of the interactions between individual tipping elements. pdpwbj.clicks.mlsend.comtdceyJ2Ijo..."
    ]
  },
  {
    "Topic": 77,
    "Count": 311,
    "Name": "77_brazil_cop30_amazon_brazils",
    "Representation": [
      "brazil",
      "cop30",
      "amazon",
      "brazils",
      "indigenous",
      "environmentalism",
      "savecongorainforest",
      "rainforest",
      "politics",
      "bibles"
    ],
    "Representative_Docs": [
      "Belém’s fake trees’ highlight contradictions of Amazon’s COP30 politics brazil environmentalism COP30 sumauma.comenarvores-f...",
      "Brazil's environment minister urges sober tone for COP30 \"It is not a party\" politics brazil environmentalism geopolitics COP30 valorinternational.globo.compoliticsnew...",
      "Belém and COP30 the perspective of a German and a Brazilian politics brazil environmentalism COP30 valorinternational.globo.comcommentaryd..."
    ]
  },
  {
    "Topic": 78,
    "Count": 308,
    "Name": "78_insurance_insurers_companies_risk",
    "Representation": [
      "insurance",
      "insurers",
      "companies",
      "risk",
      "premiums",
      "uninsurable",
      "climate",
      "change",
      "home",
      "risks"
    ],
    "Representative_Docs": [
      "James M Cain summed up insurance as us betting insurance companies that something terrible is going to happen, and the insurance companies betting it won't. The problem with climatechange is that we are right and insurance companies are taking a pounding www.nature.comarticless44...",
      "High insurance risk areas. Just ask insurance companies about the reality of climate change right now and its impacts to inflation around the world - dontlookup at the arctic",
      "How do we solve the climate change home insurance crisis? The Public's Radio EnvironmentalNews ClimateChange Insurance"
    ]
  },
  {
    "Topic": 79,
    "Count": 306,
    "Name": "79_judge_epa_funds_bidenera",
    "Representation": [
      "judge",
      "epa",
      "funds",
      "bidenera",
      "federal",
      "grants",
      "fund",
      "climatefriendly",
      "billion",
      "unfreeze"
    ],
    "Representative_Docs": [
      "apnews.comarticleepa-... The EPA can't end grants from 20 billion Biden-era fund for climate-friendly projects, a judge says",
      "EPA can't end grants from 20 billion Biden-era fund for climate-friendly projects, a judge says httpswww.wtae.comarticlefederal-judge-green-bank-funds64501974",
      "Federal judge orders immediate thaw of climate, infrastructure funds. A federal judge ruled that the EPA, the Interior, Energy Depts unlawfully froze funds under Democrats’ climate and infrastructure spending laws, ordering the agencies to immediately resume disbursing the money. Politico"
    ]
  },
  {
    "Topic": 80,
    "Count": 299,
    "Name": "80_fascism_fascist_fascists_climate",
    "Representation": [
      "fascism",
      "fascist",
      "fascists",
      "climate",
      "change",
      "the",
      "rise",
      "is",
      "we",
      "collapse"
    ],
    "Representative_Docs": [
      "Hello all. Here's the News \"They\" don't want you to see for today 17 April 2025CuiBono News War Asia Europe EU NATO Environment Climate CivilRights Fascism Economy Threats Plutocracy Tari... freedom democracy usa gop corruption fascists fascism Vote Fascists Out!",
      "Hello all. Here's the News \"They\" don't want you to see for today 17 April 2025CuiBono News War Asia Europe EU NATO Environment Climate CivilRights Fascism Economy Threats Plutocracy Tari... freedom democracy usa gop corruption fascists fascism Vote Fascists Out!",
      "Wait till you learn about the connections between global warming and rising fascism. Thinking you can only focus on one means you're going to let your children die from global warming and fascism."
    ]
  },
  {
    "Topic": 81,
    "Count": 299,
    "Name": "81_tax_carbon_rebate_rebates",
    "Representation": [
      "tax",
      "carbon",
      "rebate",
      "rebates",
      "taxes",
      "was",
      "the",
      "prices",
      "pricing",
      "it"
    ],
    "Representative_Docs": [
      "GK Average food bill went up 700 in 2024, so we need to axe the carbon tax. When you tax the farmer, tax the trucker, it shouldn't be surprised when costs go up. Also, income tax cut for bottom 30%.",
      "Yeah but it's not just that. I too thought the consumer carbon tax was a good thing.",
      "and now trump is doing HIS \"carbon tax\", with tariffs, and its a hundred times bigger than the carbon tax was, and instead of reducing carbon its to \"encourage domestic manufacturing\", which it won't, much like how the carbon tax didn't really reduce carbon output. ppl will hate it and him though!"
    ]
  },
  {
    "Topic": 82,
    "Count": 299,
    "Name": "82_god_controls_sun_christian",
    "Representation": [
      "god",
      "controls",
      "sun",
      "christian",
      "sham",
      "change",
      "religion",
      "climate",
      "mary",
      "jesus"
    ],
    "Representative_Docs": [
      "climate change is a sham. god controls the climate because he controls the sun and the sun controls the weather a republican congresswoman really said that",
      "Rep. Mary Miller says that \"climate change is a sham\" \"God controls the climate because he controls the sun and the sun controls the weather, primarily.\"",
      "Rep. Mary Miller says that \"climate change is a sham\" \"God controls the climate because he controls the sun and the sun controls the weather, primarily.\""
    ]
  },
  {
    "Topic": 83,
    "Count": 290,
    "Name": "83_pipeline_pipelines_keystone_oil",
    "Representation": [
      "pipeline",
      "pipelines",
      "keystone",
      "oil",
      "dakota",
      "cool",
      "landowners",
      "spill",
      "eminent",
      "rupture"
    ],
    "Representative_Docs": [
      "Same works PIPELINE RHETORIC. CONTROLED LEAK - environmental clean up. Keystone. I thought that was done over or is this a sector of built before the ban ? apnews.comarticlekeys... Keystone Pipeline restarted after oil spill in rural North Dakota",
      "Keystone oil pipeline leaks again in North Dakota, adding to long list of failures -The Daily Climate Pipeline More info from EcoSearch",
      "Keystone pipeline shut down after rupture There were plans to expand the pipeline, dubbed Keystone XL. But they were dropped by the Biden administration after it drew criticism from environmentalists. President Trump has recently called for the completion of the controversial pipeline. -The Hill"
    ]
  },
  {
    "Topic": 84,
    "Count": 289,
    "Name": "84_oil_car_change_an",
    "Representation": [
      "oil",
      "car",
      "change",
      "an",
      "my",
      "tire",
      "tires",
      "miles",
      "brake",
      "me"
    ],
    "Representative_Docs": [
      "schedules oil change Preferred method of contact text message Text message HEY DID YOU KNOW YOU SCHEDULED AN OIL CHANGE REMINDER YOU HAVE AN OIL CHANGE YOU HAVE AN OIL CHANGE IN LESS THAN 24 HOURS YOU HAVE AN OIL CHANGE TODAY YOU BETTER BE AT YOUR OIL CHANGE IN 1 HOUR OMG DON'T MISS THE OIL CH",
      "Took my car for an oil change and now it’s leaking oil.. after the change it’s a brand new car only 7 months old",
      "Took my car for an oil change and now it’s leaking oil.. after the change it’s a brand new car only 7 months old"
    ]
  },
  {
    "Topic": 85,
    "Count": 286,
    "Name": "85_fashion_clothes_clothing_fast",
    "Representation": [
      "fashion",
      "clothes",
      "clothing",
      "fast",
      "shirt",
      "thrift",
      "tshirt",
      "textiles",
      "environment",
      "wear"
    ],
    "Representative_Docs": [
      "End 'fast fashion' Fast fashion is fueling a waste crisis, and it’s time we take action. Every year, millions of tons of clothing end up in landfills, polluting our environment and contributing to climate change. patimes.medianet-newslet...",
      "End 'fast fashion' Fast fashion is fueling a waste crisis, and it’s time we take action. Every year, millions of tons of clothing end up in landfills, polluting our environment and contributing to climate change. patimes.medianet-newslet...",
      "Be green and sustainable for the environment. No fast fashion!"
    ]
  },
  {
    "Topic": 86,
    "Count": 280,
    "Name": "86_coachella_day_green_greenday",
    "Representation": [
      "coachella",
      "day",
      "green",
      "greenday",
      "set",
      "band",
      "charli",
      "days",
      "xcx",
      "youtube"
    ],
    "Representative_Docs": [
      "Green Day Performs at Coachella 2025 Weekend One Watch httpswww.inbella.com999397green-day-performs-at-coachella-2025-weekend-one-watch Green Day was one of last night’s Saturday, April 12 headliners at the 2025 Coachella Valley Music and Arts Festival, alongside Travis Scott. The set",
      "If you’re waiting for Green Day on Coachella, and need a quick hit, check this out. youtu.bezbWzRYpPlIY?... greenday coachella",
      "Question how many people at Coachella actually know who Green Day is?"
    ]
  },
  {
    "Topic": 87,
    "Count": 277,
    "Name": "87_lights_reg_code_promo",
    "Representation": [
      "lights",
      "reg",
      "code",
      "promo",
      "waterproof",
      "pack",
      "use",
      "solar",
      "outdoor",
      "amazon"
    ],
    "Representative_Docs": [
      "4 Pack Solar Step Lights - Waterproof LED Outdoor for 12.66, reg 29.99! -- Use Promo Code 507FY68F",
      "Solar Lights for Outside, 12 Pack Outdoor Waterproof Garden 50% off, DEAL price 14.72, reg 29.44. -- Use promo code 50A2ZUM6 Buy on Amazon",
      "Solar Lights for Outside, 12 Pack Outdoor Waterproof Garden 50% off, DEAL price 14.72, reg 29.44. -- Use promo code 50A2ZUM6 Buy on Amazon"
    ]
  },
  {
    "Topic": 88,
    "Count": 268,
    "Name": "88_dogs_dog_pet_cats",
    "Representation": [
      "dogs",
      "dog",
      "pet",
      "cats",
      "pets",
      "cat",
      "multifarious",
      "owners",
      "extensive",
      "impact"
    ],
    "Representative_Docs": [
      "Pet dogs have extensive and multifarious’ impact on environment, new research finds Dogs httpswww.europesays.com1980917 Dogs have extensive and multifarious environmental impacts, disturbing wildlife, polluting waterways and contributing to carbon emissions, new research",
      "Pet dogs have extensive and multifarious’ impact on environment, new research finds Dogs httpswww.europesays.com1980917 Dogs have extensive and multifarious environmental impacts, disturbing wildlife, polluting waterways and contributing to carbon emissions, new research",
      "Pet dogs have extensive and multifarious’ impact on environment, new research finds.’ Clearly like cats the research finds it’s the owners, not the dogs."
    ]
  },
  {
    "Topic": 89,
    "Count": 266,
    "Name": "89_epa_polluters_greenhouse_collecting",
    "Representation": [
      "epa",
      "polluters",
      "greenhouse",
      "collecting",
      "emissions",
      "reporting",
      "wwwpropublicaorgarticletrum",
      "data",
      "plans",
      "stop"
    ],
    "Representative_Docs": [
      "Trump’s EPA plans to stop collecting greenhouse gas emissions data from most polluters",
      "Trump’s EPA Plans to Stop Collecting Greenhouse Gas Emissions Data From Most Polluters",
      "Trump’s EPA Plans to Stop Collecting Greenhouse Gas Emissions Data From Most Polluters httpswww.europesays.com1985020 Trump’s EPA Plans to Stop Collecting Greenhouse Gas Emissions Data From Most Polluters httpswww.propublica.orgarticletrump-epa-greenhouse-gas-reporting-climate-crisis"
    ]
  },
  {
    "Topic": 90,
    "Count": 265,
    "Name": "90_doge_cuts_waste_cutting",
    "Representation": [
      "doge",
      "cuts",
      "waste",
      "cutting",
      "cut",
      "government",
      "10b",
      "doe",
      "axe",
      "efficiency"
    ],
    "Representative_Docs": [
      "DOGE finds more stuff we already knew about, once again proving that the biggest waste is DOGE itself.",
      "I’m sure DOGE is getting right on this, to demonstrate why this should be done nationwide, right? No? But wasn’t the whole point of DOGE to cut waste?",
      "I’m sure DOGE is getting right on this, to demonstrate why this should be done nationwide, right? No? But wasn’t the whole point of DOGE to cut waste?"
    ]
  },
  {
    "Topic": 91,
    "Count": 262,
    "Name": "91_2025_project_tracker_2050",
    "Representation": [
      "2025",
      "project",
      "tracker",
      "2050",
      "2030",
      "is",
      "playbook",
      "all",
      "we",
      "be"
    ],
    "Representative_Docs": [
      "According to the Project 2025 Tracker site, implementation of Project 2025 is now at 42%.",
      "Taking control of school curriculums is part of Project 2025. Destroying unions is part of Project 2025. Fucking over your retirement is part of Project 2025. Destroying the environment is part of Project 2025. Nuclear war is part of Project 2025. Reconsidering alliances is part of Project 2025.",
      "Taking control of school curriculums is part of Project 2025. Destroying unions is part of Project 2025. Fucking over your retirement is part of Project 2025. Destroying the environment is part of Project 2025. Nuclear war is part of Project 2025. Reconsidering alliances is part of Project 2025."
    ]
  },
  {
    "Topic": 92,
    "Count": 258,
    "Name": "92_paris_air_wwwwashingtonpostcomclimatesolu_revoir",
    "Representation": [
      "paris",
      "air",
      "wwwwashingtonpostcomclimatesolu",
      "revoir",
      "pollution",
      "dramatic",
      "maps",
      "au",
      "reveal",
      "cars"
    ],
    "Representative_Docs": [
      "Paris said au revoir to cars. Air pollution maps reveal a dramatic change.",
      "Paris said au revoir to cars. Air pollution maps reveal a dramatic change.",
      "Paris said au revoir to cars. Air pollution maps reveal a dramatic change. Air pollution fell substantially as the city restricted car traffic and made way for parks and bike lanes. httpswww.europesays.com1989681 Paris said au revoir to cars. Air pollution maps reveal a dramatic change."
    ]
  },
  {
    "Topic": 93,
    "Count": 254,
    "Name": "93_geothermal_taiwan_energy_google",
    "Representation": [
      "geothermal",
      "taiwan",
      "energy",
      "google",
      "fervo",
      "power",
      "in",
      "first",
      "heating",
      "enhanced"
    ],
    "Representative_Docs": [
      "Next-generation geothermal has the potential to meet up to 15% of global electricity demand growth through 2050. But transitioning from commercial geothermal to next-generation geothermal has its challenges.",
      "Next-generation geothermal has the potential to meet up to 15% of global electricity demand growth through 2050. But transitioning from commercial geothermal to next-generation geothermal has its challenges.",
      "Today, Google announced the first corporate geothermal energy deal in Taiwan. These first projects will add 10 MW of geothermal energy to the grid - nearly doubling its current installed geothermal capacity - and help catalyze the geothermal market across APAC. More blog.googlearound-the-g..."
    ]
  },
  {
    "Topic": 94,
    "Count": 250,
    "Name": "94_pv_magazine_solar_international",
    "Representation": [
      "pv",
      "magazine",
      "solar",
      "international",
      "gw",
      "usa",
      "australia",
      "wwwsaurenergycomsolarenergy",
      "module",
      "capacity"
    ],
    "Representative_Docs": [
      "Solar supplied over 10% of global electricity consumption in 2024 pv magazine USA pv-magazine-usa.com20250415s...",
      "Tariffs the least of U.S. solar market’s worries pv magazine USA pv-magazine-usa.com20250415t...",
      "Community solar projects generate 2.1 billion in economic impact pv magazine USA pv-magazine-usa.com20250409c..."
    ]
  },
  {
    "Topic": 95,
    "Count": 246,
    "Name": "95_straws_plastic_poilievre_plastics",
    "Representation": [
      "straws",
      "plastic",
      "poilievre",
      "plastics",
      "ban",
      "straw",
      "singleuse",
      "scrap",
      "bags",
      "paper"
    ],
    "Representative_Docs": [
      "I just don't think....straws are near the top of our list in Canada today. And why....DO PEOPLE REALLY NEED...STRAWS TO DRINK??? Poilievre promises to scrap single-use plastics ban and bring back the plastic straw www.cbc.canewspolitic...",
      "Like Trump, like Pollievre Poilievre promises to scrap single-use plastics ban and bring back the plastic straw Trump signs order to buy plastic straws, eliminate paper straws www.cbc.canewspolitic...",
      "I just don't think....straws are near the top of our list in Canada today. And why....DO PEOPLE REALLY NEED...STRAWS TO DRINK??? Poilievre promises to scrap single-use plastics ban and bring back the plastic straw www.cbc.canewspolitic..."
    ]
  },
  {
    "Topic": 96,
    "Count": 246,
    "Name": "96_factors_genetic_environmental_genes",
    "Representation": [
      "factors",
      "genetic",
      "environmental",
      "genes",
      "genetics",
      "variance",
      "differences",
      "iq",
      "heritability",
      "evidence"
    ],
    "Representative_Docs": [
      "If you read the paper, you would understand that they found that genetic factors have influence over someone’s ideologies, but that this influence is a combination of countless individual genes and environmental factors that cause those genes to be expressed.",
      "If you have some study that looks at several factors to explain a testing gap between two groups, whatever is reasonably unaccounted for exists in a box you can label, \"other possible environmental or genetic factors\" not \"genetic factors.\"",
      "If you have some study that looks at several factors to explain a testing gap between two groups, whatever is reasonably unaccounted for exists in a box you can label, \"other possible environmental or genetic factors\" not \"genetic factors.\""
    ]
  },
  {
    "Topic": 97,
    "Count": 242,
    "Name": "97_carbon_fiber_bike_frame",
    "Representation": [
      "carbon",
      "fiber",
      "bike",
      "frame",
      "fibre",
      "bikes",
      "specialized",
      "deco",
      "wheels",
      "di2"
    ],
    "Representative_Docs": [
      "Wouldn't it make more sense to build cars with MORE carbon fiber to make them carbon neutral?",
      "Need help identifying this carbon fiber bike httpswww.cyclingeu.com570396need-help-identifying-this-carbon-fiber-bike Need help identifying this carbon fiber bike by breezuschrist303",
      "\" Try carbon fiber like me. Anytime I'm around Max, I just use carbon fiber everything. \""
    ]
  },
  {
    "Topic": 98,
    "Count": 239,
    "Name": "98_princeton_funding_anxiety_research",
    "Representation": [
      "princeton",
      "funding",
      "anxiety",
      "research",
      "administration",
      "trump",
      "4m",
      "cuts",
      "princetons",
      "universities"
    ],
    "Representative_Docs": [
      "Trump administration cuts 4m to Princeton’s climate research funding Climate",
      "Breaking Trump administration cuts 4m to Princeton’s climate research funding White House claims university’s work exposed students to climate anxiety’ and exaggerated... Via The Guardian Princeton Funding Climate What's your take on this?",
      "Trump administration cuts 4m to Princeton’s climate research funding Trump"
    ]
  },
  {
    "Topic": 99,
    "Count": 238,
    "Name": "99_ocean_heatwaves_sea_rise",
    "Representation": [
      "ocean",
      "heatwaves",
      "sea",
      "rise",
      "marine",
      "level",
      "tripled",
      "length",
      "finds",
      "heat"
    ],
    "Representative_Docs": [
      "Climate Crisis Has Tripled Length of Deadly Ocean Heatwaves, Study Finds httpsnews.slashdot.orgstory2504150148201climate-crisis-has-tripled-length-of-deadly-ocean-heatwaves-study-finds",
      "Climate crisis has tripled length of deadly ocean heatwaves, study finds Climate",
      "Climate crisis has tripled length of deadly ocean heatwaves, study finds Climate Crisis Ecosystems marine httpswww.theguardian.comenvironment2025apr14climate-crisis-has-tripled-length-of-deadly-ocean-heatwaves-study-finds"
    ]
  },
  {
    "Topic": 100,
    "Count": 232,
    "Name": "100_maga_muddling_greatness_biggest",
    "Representation": [
      "maga",
      "muddling",
      "greatness",
      "biggest",
      "mistake",
      "magas",
      "minority",
      "americas",
      "away",
      "budget"
    ],
    "Representative_Docs": [
      "We now see MAGA means Muddling America’s Greatness Away. Trump's biggest strategic mistake - and biggest crime against humanity is to steal the world’s Climate Budget by pulling out of the Paris Agreement, isolating the US in a minority of one. It will bite him in the ass.",
      "Trump is showing that MAGA stands for Muddling America’s Greatness Away. His biggest mistake and crime against humanity is stealing the world's Climate Budget by pulling out of the Paris Agreement and putting the US in a minority of one. It will bite him in the ass.",
      "Trump is showing that MAGA stands for Muddling America’s Greatness Away. His biggest mistake and crime against humanity is stealing the world's Climate Budget by pulling out of the Paris Agreement and putting the US in a minority of one. It will bite him in the ass."
    ]
  },
  {
    "Topic": 101,
    "Count": 227,
    "Name": "101_hiring_apply_award_sustainability",
    "Representation": [
      "hiring",
      "apply",
      "award",
      "sustainability",
      "university",
      "environmental",
      "job",
      "awards",
      "officer",
      "looking"
    ],
    "Representative_Docs": [
      "Looking for a SummerJob? We're hiring a Community Outreach Coordinator to help spread the word about our work safeguarding the environment through law at community events in MetroVancouver. Check out the details apply by May 6 www.wcel.orgjob-posting... Pls share! studentjobs yvrjobs",
      "We're hiring at mitpress.bsky.social! I'm looking for a new assistant to work on my list and the environmental policy list. You can find more details and apply directly here careers.peopleclick.comcareerscpcl...",
      "We're excited to be hiring a Director of Operations and Development! Know someone who's a good fit for the role? Why not share this with them and encourage them to apply? edusky sustainability education charity environment"
    ]
  },
  {
    "Topic": 102,
    "Count": 223,
    "Name": "102_germany_german_coalition_germanys",
    "Representation": [
      "germany",
      "german",
      "coalition",
      "germanys",
      "coal",
      "plants",
      "energy",
      "power",
      "spd",
      "coalfired"
    ],
    "Representative_Docs": [
      "What’s Next for Germany’s Energy Future? An Overview of the Just Announced Coalition Agreement White Case LLP httpswww.europesays.com1987201 After the February election, Germany’s energy transition is at a critical turning point. With the just announced coalition",
      "Germany Forms New Coalition Amid Energy Strategy Debate httpswww.europesays.com1999293 On April 9, 2025, a coalition agreement was reached in Germany, marking a significant political shift as the",
      "trump said Germany is opening a coal plant every week. In reality Germany is closing coal plants."
    ]
  },
  {
    "Topic": 103,
    "Count": 221,
    "Name": "103_salmon_fish_fishing_fisheries",
    "Representation": [
      "salmon",
      "fish",
      "fishing",
      "fisheries",
      "seafood",
      "overfishing",
      "mackerel",
      "crabs",
      "environmental",
      "tas"
    ],
    "Representative_Docs": [
      "A federal judge just hit the brakes on Trump’s plan to fast-track industrial fish farming in the Gulf. Advocates for marine health say aquaculture \"has no place in U.S. ocean waters.\" grist.orgfood-and-agr... Ocean Fishing Seafood Climate Marine",
      "httpstheconversation.comdrug-pollution-in-water-is-making-salmon-take-more-risks-new-research-254312.",
      "Drug pollution in water is making salmon take more risks - new research -The Conversation Salmon Pollution Water More info from EcoSearch"
    ]
  },
  {
    "Topic": 104,
    "Count": 214,
    "Name": "104_regulations_environment_environmental_they",
    "Representation": [
      "regulations",
      "environment",
      "environmental",
      "they",
      "protection",
      "epa",
      "people",
      "regulation",
      "the",
      "not"
    ],
    "Representative_Docs": [
      "Then the other issues of regulations! So for every new regulation, they want to get rid of ten. So they are out to destroy our country by deregulating what businesses can can’t do. So when they release mercury and lead into our land water ways and poison us, we will be powerless!!!!",
      "How is anyone against regulations that protect the environment? Like this to me!",
      "Exactly! As we destroy the EPA and environmental regulations for air, land, and water."
    ]
  },
  {
    "Topic": 105,
    "Count": 214,
    "Name": "105_rice_arsenic_toxic_levels",
    "Representation": [
      "rice",
      "arsenic",
      "toxic",
      "levels",
      "change",
      "worlds",
      "staple",
      "lancet",
      "arstechnicacomscience2025",
      "grain"
    ],
    "Representative_Docs": [
      "\"Climate change will make rice toxic, say researchers. Warmer temperatures and increased carbon dioxide will boost arsenic levels in rice.\"",
      "New research Climate change will make rice toxic, say researchers. Warmer temperatures and increased carbon dioxide will boost arsenic levels in rice. insideclimatenews.orgnews1604202... food health climatechange",
      "New research Climate change will make rice toxic, say researchers. Warmer temperatures and increased carbon dioxide will boost arsenic levels in rice. insideclimatenews.orgnews1604202... food health climatechange"
    ]
  },
  {
    "Topic": 106,
    "Count": 213,
    "Name": "106_concrete_cement_timber_wood",
    "Representation": [
      "concrete",
      "cement",
      "timber",
      "wood",
      "brick",
      "carbon",
      "defuse",
      "buildings",
      "bomb",
      "made"
    ],
    "Representative_Docs": [
      "Carbon emissions from concrete production, urban heat islands, dredging rivers, estuaries the sea bed for sand - how can we make cleaner concrete? Use less concrete? Build to last? Recycle concrete steel? BBC Rare Earth asks how we build a world we want to live in www.bbc.co.ukprogrammesm...",
      "Carbon emissions from concrete production, urban heat islands, dredging rivers, estuaries the sea bed for sand - how can we make cleaner concrete? Use less concrete? Build to last? Recycle concrete steel? BBC Rare Earth asks how we build a world we want to live in www.bbc.co.ukprogrammesm...",
      "Great to see this. Cement production for concrete is a huge source of carbon emissions 8% worldwide."
    ]
  },
  {
    "Topic": 107,
    "Count": 211,
    "Name": "107_chocolate_easter_cocoa_eciunet",
    "Representation": [
      "chocolate",
      "easter",
      "cocoa",
      "eciunet",
      "cacao",
      "eggs",
      "egg",
      "sawyer",
      "prices",
      "amber"
    ],
    "Representative_Docs": [
      "Easter chocolate prices rise in the UK as a cocoa crisis looms Farmers in Ivory Coast, the world’s largest cocoa producer, warn that cocoa trees could be wiped out by 2030 due to the climate crisis and underinvestment. Read more in the-independent.com www.independent.co.ukclimate-chan...",
      "Easter chocolate cocoa price up a third as extreme weather and climate change bite eciu.netmediapress-...",
      "Noticed the soaring cost of chocolate? With climate change pushing up cocoa prices, I looked at how some companies hope to grow cocoa in vats instead of on trees And, yes, cultured chocolate really does taste like chocolate www.newscientist.comarticlemg26..."
    ]
  },
  {
    "Topic": 108,
    "Count": 208,
    "Name": "108_podcast_episode_listen_podcasts",
    "Representation": [
      "podcast",
      "episode",
      "listen",
      "podcasts",
      "new",
      "about",
      "talk",
      "with",
      "climate",
      "on"
    ],
    "Representative_Docs": [
      "NEW EPISODE OUT TODAY! STAY TUNED podcast power politics climate",
      "youtu.beGhUiU7IVCME NEW EPISODE! podcast power politics climatechange",
      "youtu.beGhUiU7IVCME NEW EPISODE! podcast power politics climatechange"
    ]
  },
  {
    "Topic": 109,
    "Count": 205,
    "Name": "109_memphis_xai_generators_musks",
    "Representation": [
      "memphis",
      "xai",
      "generators",
      "musks",
      "turbines",
      "elon",
      "35",
      "methane",
      "facility",
      "permits"
    ],
    "Representative_Docs": [
      "Elon Musk’s xAI powering its facility in Memphis with illegal’ generators Advocacy group says the firm has doubled the number of methane gas burning turbines it’s using without permits apple.newsA7O5iObfTgS...",
      "Guardian - Elon Musk’s xAI powering its facility in Memphis with illegal’ generators Advocacy group says the firm has doubled the number of methane gas burning turbines it’s using without permits.",
      "Elon Musk’s xAI powering its facility in Memphis with illegal’ generators. Advocacy group says the firm has doubled the number of methane gas burning turbines it’s using without permits."
    ]
  },
  {
    "Topic": 110,
    "Count": 204,
    "Name": "110_resilience_africa_adaptation_communities",
    "Representation": [
      "resilience",
      "africa",
      "adaptation",
      "communities",
      "african",
      "climate",
      "resilient",
      "investing",
      "proof",
      "aeoncoessaystosu"
    ],
    "Representative_Docs": [
      "Africa is proof that investing in climate resilience works and that it makes good business sense Africa ClimateResilience www.theguardian.comglobal-devel...",
      "Keep going, IL! govpritzker.illinois.gov seancasten.bsky.social Africa proof investing in climate resilience works. Continent’s leading initiative,Africa Adaptation Acceleration Programme, channelled 15bn to strengthen essential systems against climate shocks. Almost 1 MILLION jobs created.",
      "Opinion Africa is proof that investing in climate resilience works and that it makes good business sense - The Guardian"
    ]
  },
  {
    "Topic": 111,
    "Count": 202,
    "Name": "111_commissions_open_commissionsopen_dm",
    "Representation": [
      "commissions",
      "open",
      "commissionsopen",
      "dm",
      "slots",
      "vgen",
      "commission",
      "me",
      "are",
      "my"
    ],
    "Representative_Docs": [
      "Commissions Commissionsopen 12 Did a small adjustment to my commission info, but I'm also signal boosting cause I'm going through some big changes and I could definitely use the help. Commissions will be always open as usual!",
      "Commissions Open! fill out the order form here httpsforms.gle2CbYxifnFMyeRgF49",
      "Commissions are open again, there have been changes to the prices and rules."
    ]
  },
  {
    "Topic": 112,
    "Count": 200,
    "Name": "112_biodiversity_loss_conservation_nature",
    "Representation": [
      "biodiversity",
      "loss",
      "conservation",
      "nature",
      "species",
      "our",
      "ecosystems",
      "kunmingmontreal",
      "ipbesnet",
      "2030"
    ],
    "Representative_Docs": [
      "Why should we care about biodiversity? Biodiversity supports everything in nature that we need to survive, including food clean water shelter Learn more httpscbd.int",
      "Yes do something and dont forget about the loss of biodiversity.",
      "Biodiversity is declining globally at rates unprecedented in human history. The Alternet summer school focuses on the challenge of biodiversity management and conservation by exploring drivers of biodiversity loss. Registration is open! Apply today alterneteurope.eusummerschool..."
    ]
  }
]